
-------------------------------------
-- 物品附魔信息庫 Author: M
-------------------------------------

local MAJOR, MINOR = "LibItemEnchant.7000", 1
local lib = LibStub:NewLibrary(MAJOR, MINOR)

if not lib then return end

lib.ScanTip = CreateFrame("GameTooltip", "LibItemEnchant_ScanTooltip", nil, "GameTooltipTemplate")
lib.ScanTipName = lib.ScanTip:GetName()

-- GENERATE BY https://wago.tools/db2/ItemEffect
local EnchantItemDB = {
    [15] = 2304, -- 轻型护甲片
    [16] = 2313, -- 中型护甲片
    [17] = 4265, -- 重型护甲片
    [18] = 8173, -- 厚重护甲片
    [30] = 4405, -- 粗制瞄准镜
    [32] = 4406, -- 普通瞄准镜
    [33] = 4407, -- 精确瞄准镜
    [34] = 6043, -- 铁质平衡锤
    [36] = 5421, -- 炽热魔符
    [37] = 6041, -- 钢质武器链
    [43] = 6042, -- 铁质盾刺
    [463] = 7967, -- 秘银盾刺
    [464] = 7969, -- 秘银马刺
    [663] = 10546, -- 致命瞄准镜
    [664] = 10548, -- 狙击瞄准镜
    [1483] = 11622, -- 次级冥思秘药
    [1503] = 11642, -- 次级体质秘药
    [1504] = 11643, -- 次级坚韧秘药
    [1505] = 11644, -- 次级适应秘药
    [1506] = 11645, -- 次级贪婪秘药
    [1507] = 11646, -- 次级贪婪秘药
    [1508] = 11647, -- 次级贪婪秘药
    [1509] = 11648, -- 次级贪婪秘药
    [1510] = 11649, -- 次级贪婪秘药
    [1704] = 12645, -- 瑟银盾刺
    [1843] = 15564, -- 毛皮护甲片
    [2483] = 18169, -- 火焰黎明衬肩
    [2484] = 18170, -- 冰霜黎明衬肩
    [2485] = 18171, -- 奥术黎明衬肩
    [2486] = 18172, -- 自然黎明衬肩
    [2487] = 18173, -- 暗影黎明衬肩
    [2488] = 18182, -- 多彩黎明衬肩
    [2503] = 18251, -- 熔火护甲片
    [2543] = 18329, -- 急速秘药
    [2544] = 18330, -- 专注秘药
    [2545] = 18331, -- 防护秘药
    [2583] = 19782, -- 力量的证明
    [2584] = 19783, -- 调和的徽记
    [2587] = 19786, -- 巫毒的警觉
    [2588] = 19787, -- 魔法的视域
    [2589] = 19788, -- 不祥的妖术
    [2590] = 19789, -- 预言的光环
    [2591] = 19790, -- 灵魂的安抚
    [2604] = 20078, -- 赞达拉宁静徽记
    [2605] = 20076, -- 赞达拉魔精徽记
    [2606] = 20077, -- 赞达拉力量徽记
    [2681] = 22635, -- 野性戒卫
    [2682] = 22636, -- 寒冰戒卫
    [2683] = 22638, -- 暗影戒卫
    [2714] = 23530, -- 魔钢盾刺
    [2715] = 23547, -- 天灾的活力
    [2716] = 23549, -- 天灾的坚韧
    [2717] = 23548, -- 天灾的威严
    [2721] = 23545, -- 天灾的力量
    [2722] = 23764, -- 精金瞄准镜
    [2723] = 23765, -- 氪金瞄准镜
    [2745] = 24275, -- 银色魔线
    [2746] = 24276, -- 金色魔线
    [2747] = 24273, -- 秘法魔线
    [2748] = 24274, -- 符文魔线
    [2792] = 25650, -- 结缔皮护甲片
    [2793] = 25651, -- 守备官的护甲片
    [2794] = 25652, -- 魔导师的护甲片
    [2841] = 34330, -- 厚重结缔皮护甲片
    [2977] = 28882, -- 护卫铭文
    [2978] = 28889, -- 强力护卫铭文
    [2979] = 28878, -- 信仰铭文
    [2980] = 28887, -- 强力信仰铭文
    [2981] = 28881, -- 戒律铭文
    [2982] = 28886, -- 强力戒律铭文
    [2983] = 28885, -- 复仇铭文
    [2984] = 29483, -- 暗影护甲片
    [2985] = 29485, -- 烈焰护甲片
    [2986] = 28888, -- 强力复仇铭文
    [2987] = 29486, -- 冰霜护甲片
    [2988] = 29487, -- 自然护甲片
    [2989] = 29488, -- 奥术护甲片
    [2990] = 28908, -- 骑士铭文
    [2991] = 28911, -- 强力骑士铭文
    [2992] = 28904, -- 神谕铭文
    [2993] = 28912, -- 强力神谕铭文
    [2994] = 28903, -- 宝珠铭文
    [2995] = 28909, -- 强力宝珠铭文
    [2996] = 28907, -- 利刃铭文
    [2997] = 28910, -- 强力利刃铭文
    [2998] = 29187, -- 耐久铭文
    [2999] = 29186, -- 防御者秘药
    [3001] = 29189, -- 恢复秘药
    [3002] = 29191, -- 强能秘药
    [3003] = 29192, -- 凶暴秘药
    [3004] = 29193, -- 角斗士秘药
    [3005] = 29194, -- 自然防护秘药
    [3006] = 29195, -- 奥术防护秘药
    [3007] = 29196, -- 火焰防护秘药
    [3008] = 29198, -- 冰霜防护秘药
    [3009] = 29199, -- 暗影防护秘药
    [3010] = 29533, -- 眼镜蛇皮腿甲片
    [3011] = 29534, -- 裂蹄腿甲片
    [3012] = 29535, -- 虚空毒蛇腿甲片
    [3013] = 29536, -- 虚空裂蹄腿甲片
    [3095] = 30845, -- 多彩防护秘药
    [3096] = 30846, -- 流放者秘药
    [3223] = 33185, -- 精金武器链
    [3260] = 34207, -- 手套强化护甲片
    [3269] = 34836, -- 真银渔线
    [3290] = 39300, -- 弹簧披风扩张器
    [3325] = 38371, -- 冰虫腿甲片
    [3326] = 38372, -- 蛛魔腿甲片
    [3329] = 38375, -- 北地护甲片
    [3330] = 38376, -- 厚北地护甲片
    [3331] = 38377, -- 龙鳞腿甲片
    [3332] = 38378, -- 巨龙鳞腿甲片
    [3599] = 40776, -- 单兵电磁脉冲发生器
    [3601] = 40800, -- 远距离侦测腰带夹
    [3603] = 41091, -- 手部火箭发射器
    [3605] = 41111, -- 高弹力衬垫
    [3606] = 41118, -- 硝化甘油推进器
    [3607] = 41146, -- 太阳瞄准镜
    [3608] = 41167, -- 觅心瞄准镜
    [3718] = 41601, -- 闪光魔线
    [3719] = 41602, -- 辉煌魔线
    [3720] = 41603, -- 碧蓝魔线
    [3721] = 41604, -- 天蓝魔线
    [3731] = 41976, -- 泰坦神铁武器链
    [3748] = 42500, -- 泰坦神铁盾刺
    [3754] = 19785, -- 猎鹰的召唤
    [3755] = 19784, -- 死亡的拥抱
    [3756] = 43097, -- 毛皮衬垫 - 攻击强度
    [3775] = 43302, -- 铁律铭文
    [3776] = 43303, -- 霜刃铭文
    [3777] = 43304, -- 王者铭文
    [3794] = 44068, -- 统御铭文
    [3797] = 44075, -- 统御秘药
    [3806] = 44129, -- 次级风暴铭文
    [3807] = 44130, -- 次级峭壁铭文
    [3808] = 44133, -- 强效利斧铭文
    [3809] = 44134, -- 强效峭壁铭文
    [3810] = 44135, -- 强效风暴铭文
    [3811] = 44136, -- 强效巅峰铭文
    [3812] = 44137, -- 冰霜之魂秘药
    [3813] = 44138, -- 防毒秘药
    [3814] = 44139, -- 消散之影秘药
    [3815] = 44140, -- 月食秘药
    [3816] = 44141, -- 烈焰之魂秘药
    [3817] = 44149, -- 折磨秘药
    [3818] = 44150, -- 坚定防御者秘药
    [3819] = 44152, -- 祝福治愈秘药
    [3820] = 44159, -- 燃烧谜团秘药
    [3822] = 38373, -- 霜皮腿甲片
    [3823] = 38374, -- 冰鳞腿甲片
    [3842] = 44701, -- 凶残角斗士秘药
    [3843] = 44739, -- 钻石折射瞄准镜
    [3849] = 44936, -- 泰坦神铁护板
    [3852] = 44957, -- 强效角斗士铭文
    [3853] = 44963, -- 土灵腿甲片
    [3875] = 44131, -- 次级利斧铭文
    [3876] = 44132 -- 次级巅峰铭文
}

-- GENERATE BY https://wago.tools/db2/SpellEffect
local EnchantSpellDB = {
    [1] = 2605, -- 打磨利刃
    [15] = 2831, -- 护甲 +8
    [16] = 2832, -- 护甲 +16
    [17] = 2833, -- 护甲 +24
    [18] = 10344, -- 护甲 +32
    [24] = 7443, -- 附魔胸甲 - 初级法力
    [30] = 3974, -- 粗制瞄准镜
    [32] = 3975, -- 普通瞄准镜
    [33] = 3976, -- 精确瞄准镜
    [34] = 7218, -- 武器平衡锤
    [36] = 6296, -- 附魔：火焰
    [37] = 7220, -- 武器链
    [43] = 7216, -- 铁质盾刺
    [44] = 7426, -- 附魔胸甲 - 初级吸收
    [63] = 13538, -- 附魔胸甲 - 次级吸收
    [65] = 7454, -- 附魔披风 - 初级抗性
    [242] = 7748, -- 附魔胸甲 - 次级生命
    [243] = 7766, -- 附魔护腕 - 初级精神
    [246] = 7776, -- 附魔胸甲 - 次级法力
    [248] = 7782, -- 附魔护腕 - 初级力量
    [249] = 7786, -- 附魔武器 - 初级屠兽
    [250] = 7788, -- 附魔武器 - 初级攻击
    [254] = 7857, -- 附魔胸甲 - 生命
    [256] = 7861, -- 附魔披风 - 次级火焰抗性
    [368] = 34004, -- 附魔披风 - 强效敏捷
    [369] = 34001, -- 附魔护腕 - 特效智力
    [463] = 9781, -- 秘银盾刺
    [464] = 9783, -- 秘银马刺
    [663] = 12459, -- 致命瞄准镜
    [664] = 12460, -- 狙击瞄准镜
    [684] = 33995, -- 附魔手套 - 特效力量
    [744] = 13421, -- 附魔披风 - 次级防护
    [783] = 7771, -- 附魔披风 - 初级防护
    [803] = 13898, -- 附魔武器 - 烈焰
    [804] = 13522, -- 附魔披风 - 次级暗影抵抗
    [805] = 13943, -- 附魔武器 - 强效攻击
    [823] = 13536, -- 附魔护腕 - 次级力量
    [843] = 13607, -- 附魔胸甲 - 法力
    [844] = 13612, -- 附魔手套 - 采矿
    [845] = 13617, -- 附魔手套 - 草药学
    [847] = 13626, -- 附魔胸甲 - 初级属性
    [850] = 13640, -- 附魔胸甲 - 强效生命
    [853] = 13653, -- 附魔武器 - 次级屠兽
    [854] = 13655, -- 附魔武器 - 次级元素杀手
    [857] = 13663, -- 附魔胸甲 - 强效法力
    [863] = 13689, -- 附魔盾牌 - 次级格挡
    [865] = 13698, -- 附魔手套 - 剥皮
    [866] = 13700, -- 附魔胸甲 - 次级状态
    [884] = 13746, -- 附魔披风 - 强效防御
    [903] = 13794, -- 附魔披风 - 抗性
    [905] = 13822, -- 附魔护腕 - 智力
    [906] = 13841, -- 附魔手套 - 高级采矿
    [908] = 13858, -- 附魔胸甲 - 超强生命
    [909] = 13868, -- 附魔手套 - 高级草药学
    [911] = 13890, -- 附魔靴子 - 初级速度
    [912] = 13915, -- 附魔武器 - 屠魔
    [913] = 13917, -- 附魔胸甲 - 超强法力
    [923] = 13931, -- 附魔护腕 - 偏斜
    [924] = 7428, -- 附魔护腕 - 初级偏斜
    [925] = 13646, -- 附魔护腕 - 次级偏斜
    [928] = 13941, -- 附魔胸甲 - 状态
    [930] = 13947, -- 附魔手套 - 骑乘
    [931] = 13948, -- 附魔手套 - 初级加速
    [1071] = 34009, -- 附魔盾牌 - 特效耐力
    [1075] = 44528, -- 附魔靴子 - 强效坚韧
    [1099] = 60663, -- 附魔披风 - 特效敏捷
    [1103] = 44633, -- 附魔武器 - 优异敏捷
    [1128] = 60653, -- 附魔盾牌 - 强效智力
    [1144] = 33990, -- 附魔胸甲 - 特效精神
    [1257] = 34005, -- 附魔披风 - 强效奥术抗性
    [1262] = 44596, -- 附魔披风 - 超强奥术抗性
    [1354] = 44556, -- 附魔披风 - 超强火焰抗性
    [1400] = 44494, -- 附魔披风 - 超强自然抗性
    [1441] = 34006, -- 附魔披风 - 强效暗影抗性
    [1446] = 44590, -- 附魔披风 - 超强暗影抗性
    [1483] = 15340, -- 次级奥术融合
    [1503] = 15389, -- 次级奥术融合
    [1504] = 15391, -- 次级奥术融合
    [1505] = 15394, -- 次级奥术融合
    [1506] = 15397, -- 次级奥术融合
    [1507] = 15400, -- 次级奥术融合
    [1508] = 15402, -- 次级奥术融合
    [1509] = 15404, -- 次级奥术融合
    [1510] = 15406, -- 次级奥术融合
    [1523] = 15427, -- 强效奥术融合
    [1524] = 15429, -- 强效奥术融合
    [1525] = 15439, -- 强效奥术融合
    [1526] = 15441, -- 强效奥术融合
    [1527] = 15444, -- 强效奥术融合
    [1528] = 15446, -- 强效奥术融合
    [1529] = 15449, -- 强效奥术融合
    [1530] = 15458, -- 强效奥术融合
    [1532] = 15463, -- 传说奥术融合
    [1543] = 15490, -- 传说奥术融合
    [1594] = 33996, -- 附魔手套 - 突袭
    [1597] = 60763, -- 附魔靴子 - 强效突袭
    [1600] = 60616, -- 附魔护腕 - 打击
    [1603] = 60668, -- 附魔手套 - 碾压
    [1606] = 60621, -- 附魔武器 - 强效潜能
    [1704] = 16623, -- 瑟银盾刺
    [1843] = 19057, -- 护甲 +40
    [1883] = 20008, -- 附魔护腕 - 强效智力
    [1884] = 20009, -- 附魔护腕 - 超强精神
    [1885] = 20010, -- 附魔护腕 - 超强力量
    [1886] = 20011, -- 附魔护腕 - 超强耐力
    [1889] = 20015, -- 附魔披风 - 超强防御
    [1890] = 20016, -- 附魔盾牌 - 活力
    [1892] = 20026, -- 附魔胸甲 - 特效生命
    [1893] = 20028, -- 附魔胸甲 - 特效法力
    [1894] = 20029, -- 附魔武器 - 冰寒
    [1896] = 20030, -- 附魔双手武器 - 超强冲击
    [1899] = 20033, -- 附魔武器 - 邪恶武器
    [1900] = 20034, -- 附魔武器 - 十字军
    [1903] = 20035, -- 附魔双手武器 - 特效精神
    [1904] = 20036, -- 附魔双手武器 - 特效智力
    [1952] = 44489, -- 附魔盾牌 - 防御
    [1953] = 47766, -- 附魔胸甲 - 强效防御
    [2322] = 33999, -- 附魔手套 - 特效治疗
    [2326] = 44635, -- 附魔护腕 - 强效法术强度
    [2332] = 60767, -- 附魔护腕 - 超强法术能量
    [2381] = 44509, -- 附魔胸甲 - 强效法力回复
    [2443] = 21931, -- 附魔武器 - 寒冬之力
    [2463] = 13657, -- 附魔披风 - 火焰抗性
    [2483] = 22593, -- 火焰黎明衬肩
    [2484] = 22594, -- 冰霜黎明衬肩
    [2485] = 22598, -- 奥术黎明衬肩
    [2486] = 22597, -- 自然黎明衬肩
    [2487] = 22596, -- 暗影黎明衬肩
    [2488] = 22599, -- 多彩黎明衬肩
    [2503] = 22725, -- 防御等级 +5
    [2504] = 22749, -- 附魔武器 - 法术能量
    [2505] = 22750, -- 附魔武器 - 治疗能量
    [2543] = 22840, -- 急速秘药
    [2544] = 22844, -- 专注秘药
    [2545] = 22846, -- 防护秘药
    [2563] = 23799, -- 附魔武器 - 力量
    [2565] = 23801, -- 附魔护腕 - 法力回复
    [2568] = 23804, -- 附魔武器 - 强效智力
    [2583] = 24149, -- 力量的证明
    [2584] = 24160, -- 调和的徽记
    [2587] = 24163, -- 巫毒的警觉
    [2588] = 24164, -- 魔法的视域
    [2589] = 24165, -- 不祥的妖术
    [2590] = 24167, -- 预言的光环
    [2591] = 24168, -- 灵魂的安抚
    [2603] = 13620, -- 附魔手套 - 钓鱼
    [2604] = 24420, -- 赞达拉宁静徽记
    [2605] = 24421, -- 赞达拉魔精徽记
    [2606] = 24422, -- 赞达拉力量徽记
    [2614] = 25073, -- 附魔手套 - 暗影能量
    [2615] = 25074, -- 附魔手套 - 冰霜能量
    [2616] = 25078, -- 附魔手套 - 火焰能量
    [2617] = 25079, -- 附魔手套 - 治疗能量
    [2622] = 25086, -- 附魔披风 - 躲闪
    [2646] = 27837, -- 附魔双手武器 - 敏捷
    [2647] = 27899, -- 附魔护腕 - 强壮
    [2653] = 27944, -- 附魔盾牌 - 坚韧盾牌
    [2654] = 27945, -- 附魔盾牌 - 智力
    [2655] = 27946, -- 附魔盾牌 - 盾牌格挡
    [2656] = 27948, -- 附魔长靴 - 活力
    [2657] = 27951, -- 附魔长靴 - 灵巧
    [2658] = 27954, -- 附魔长靴 - 稳固
    [2659] = 27957, -- 附魔胸甲 - 优异生命
    [2662] = 27961, -- 附魔披风 - 特效护甲
    [2664] = 27962, -- 附魔披风 - 特效抗性
    [2666] = 27968, -- 附魔武器 - 特效智力
    [2667] = 27971, -- 附魔双手武器 - 野蛮
    [2668] = 27972, -- 附魔武器 - 潜能
    [2669] = 27975, -- 附魔武器 - 特效法术能量
    [2670] = 27977, -- 附魔双手武器 - 特效敏捷
    [2671] = 27981, -- 附魔武器 - 阳炎
    [2672] = 27982, -- 附魔武器 - 魂霜
    [2673] = 27984, -- 附魔武器 - 猫鼬
    [2674] = 28003, -- 附魔武器 - 魔法激荡
    [2675] = 28004, -- 附魔武器 - 作战专家
    [2679] = 27913, -- 附魔护腕 - 优秀法力回复
    [2681] = 28161, -- 野性戒卫
    [2682] = 28163, -- 寒冰戒卫
    [2683] = 28165, -- 暗影戒卫
    [2714] = 29454, -- 魔钢盾刺
    [2715] = 29475, -- 天灾的活力
    [2716] = 29480, -- 天灾的坚韧
    [2717] = 29483, -- 天灾的威严
    [2721] = 29467, -- 天灾的力量
    [2722] = 30250, -- 精金瞄准镜
    [2723] = 30252, -- 氪金瞄准镜
    [2745] = 31369, -- 银色魔线
    [2746] = 31370, -- 金色魔线
    [2747] = 31371, -- 秘法魔线
    [2748] = 31372, -- 符文魔线
    [2792] = 32397, -- 结缔皮护甲片
    [2793] = 32398, -- 守备官的护甲片
    [2794] = 32399, -- 魔导师的护甲片
    [2841] = 44968, -- 厚重结缔皮护甲片
    [2928] = 27924, -- 附魔戒指 - 法术能量
    [2929] = 27920, -- 附魔戒指 - 打击
    [2930] = 27926, -- 附魔戒指 - 治疗能量
    [2931] = 27927, -- 附魔戒指 - 属性
    [2933] = 33992, -- 附魔胸甲 - 特效韧性
    [2934] = 33993, -- 附魔手套 - 冲击
    [2935] = 33994, -- 附魔手套 - 精确打击
    [2937] = 33997, -- 附魔手套 - 特效法术能量
    [2938] = 34003, -- 附魔披风 - 法术穿透
    [2939] = 34007, -- 附魔长靴 - 豹之迅捷
    [2940] = 34008, -- 附魔长靴 - 野猪之速
    [2977] = 35355, -- 护卫铭文
    [2978] = 35402, -- 强力护卫铭文
    [2979] = 35403, -- 信仰铭文
    [2980] = 35404, -- 强力信仰铭文
    [2981] = 35405, -- 戒律铭文
    [2982] = 35406, -- 强力戒律铭文
    [2983] = 35407, -- 复仇铭文
    [2984] = 35415, -- 暗影护甲片
    [2985] = 35416, -- 烈焰护甲片
    [2986] = 35417, -- 强力复仇铭文
    [2987] = 35418, -- 冰霜护甲片
    [2988] = 35419, -- 自然护甲片
    [2989] = 35420, -- 奥术护甲片
    [2990] = 35432, -- 骑士铭文
    [2991] = 35433, -- 强力骑士铭文
    [2992] = 35434, -- 神谕铭文
    [2993] = 35435, -- 强力神谕铭文
    [2994] = 35436, -- 宝珠铭文
    [2995] = 35437, -- 强力宝珠铭文
    [2996] = 35438, -- 利刃铭文
    [2997] = 35439, -- 强力利刃铭文
    [2998] = 35441, -- 耐久铭文
    [2999] = 35443, -- 防御者秘药
    [3001] = 35445, -- 恢复秘药
    [3002] = 35447, -- 强能秘药
    [3003] = 35452, -- 凶暴秘药
    [3004] = 35453, -- 角斗士秘药
    [3005] = 35454, -- 自然防护秘药
    [3006] = 35455, -- 奥术防护秘药
    [3007] = 35456, -- 火焰防护秘药
    [3008] = 35457, -- 冰霜防护秘药
    [3009] = 35458, -- 暗影防护秘药
    [3010] = 35488, -- 眼镜蛇皮腿甲片
    [3011] = 35489, -- 裂蹄腿甲片
    [3012] = 35490, -- 虚空毒蛇腿甲片
    [3013] = 35495, -- 虚空裂蹄腿甲片
    [3095] = 37889, -- 多彩防护秘药
    [3096] = 37891, -- 流放者秘药
    [3150] = 33991, -- 附魔胸甲 - 优秀法力回复
    [3223] = 42687, -- 精金武器链
    [3225] = 42974, -- 附魔武器 - 斩杀
    [3230] = 44483, -- 附魔披风 - 超强冰霜抗性
    [3232] = 47901, -- 附魔靴子 - 海象人的活力
    [3233] = 27958, -- 附魔胸甲 - 优异法力
    [3234] = 44488, -- 附魔手套 - 精确
    [3236] = 44492, -- 附魔胸甲 - 极效生命
    [3238] = 44506, -- 附魔手套 - 采集
    [3239] = 44524, -- 附魔武器 - 破冰
    [3241] = 44576, -- 附魔武器 - 生命护卫
    [3243] = 44582, -- 附魔披风 - 法术穿刺
    [3244] = 44584, -- 附魔靴子 - 强效活力
    [3245] = 44588, -- 附魔胸甲 - 优异韧性
    [3246] = 44592, -- 附魔手套 - 优异法术强度
    [3247] = 44595, -- 附魔双手武器 - 天灾斩除
    [3249] = 44612, -- 附魔手套 - 强效冲击
    [3251] = 44621, -- 附魔武器 - 巨人杀手
    [3252] = 44623, -- 附魔胸甲 - 超级属性
    [3253] = 44625, -- 附魔手套 - 士兵
    [3256] = 44631, -- 附魔披风 - 暗影护甲
    [3260] = 44769, -- 手套强固
    [3269] = 45697, -- 真银渔线
    [3273] = 46578, -- 附魔武器 - 死亡霜冻
    [3290] = 52639, -- 弹簧披风扩张器
    [3294] = 47672, -- 附魔披风 - 极效护甲
    [3296] = 47899, -- 附魔披风 - 智慧
    [3297] = 47900, -- 附魔胸甲 - 超级生命
    [3319] = 50465, -- 插槽单手武器
    [3325] = 50901, -- 冰虫腿甲片
    [3326] = 50902, -- 蛛魔腿甲片
    [3329] = 50906, -- 北地护甲片
    [3330] = 50909, -- 厚北地护甲片
    [3331] = 50911, -- 龙鳞腿甲片
    [3332] = 50913, -- 巨龙鳞腿甲片
    [3365] = 53323, -- 裂刃符文
    [3366] = 53331, -- 巫妖斩除符文
    [3367] = 53342, -- 法术碎裂符文
    [3368] = 53344, -- 堕落十字军符文
    [3369] = 53341, -- 灰烬冰河符文
    [3370] = 53343, -- 冰锋符文
    [3594] = 54446, -- 破刃符文
    [3595] = 54447, -- 法术阻断符文
    [3599] = 54736, -- 单兵电磁脉冲发生器
    [3601] = 54793, -- 弹带
    [3603] = 54998, -- 手部火箭发射器
    [3604] = 54999, -- 超级加速器
    [3605] = 55002, -- 高弹力衬垫
    [3606] = 55016, -- 硝化甘油推进器
    [3607] = 55076, -- 太阳瞄准镜
    [3608] = 55135, -- 觅心瞄准镜
    [3718] = 55630, -- 闪光魔线
    [3719] = 55631, -- 辉煌魔线
    [3720] = 55632, -- 碧蓝魔线
    [3721] = 55634, -- 天蓝魔线
    [3722] = 55642, -- 亮纹刺绣
    [3728] = 55769, -- 黑光刺绣
    [3730] = 55777, -- 剑刃刺绣
    [3731] = 55836, -- 泰坦神铁武器链
    [3748] = 56353, -- 泰坦神铁盾刺
    [3754] = 24162, -- 猎鹰的召唤
    [3755] = 24161, -- 死亡之拥
    [3756] = 57683, -- 毛皮衬垫 - 攻击强度
    [3757] = 57690, -- 毛皮衬垫 - 耐力
    [3758] = 57691, -- 毛皮衬垫 - 法术强度
    [3759] = 57692, -- 毛皮衬垫 - 火焰抗性
    [3760] = 57694, -- 毛皮衬垫 - 冰霜抗性
    [3761] = 57696, -- 毛皮衬垫 - 暗影抗性
    [3762] = 57699, -- 毛皮衬垫 - 自然抗性
    [3763] = 57701, -- 毛皮衬垫 - 奥术抗性
    [3775] = 58126, -- 铁律铭文
    [3776] = 58128, -- 霜刃铭文
    [3777] = 58129, -- 王者铭文
    [3788] = 59619, -- 附魔武器 - 精确
    [3789] = 59621, -- 附魔武器 - 狂暴
    [3790] = 59625, -- 附魔武器 - 黑魔法
    [3791] = 59636, -- 附魔戒指 - 耐力
    [3793] = 59771, -- 凯旋铭文
    [3794] = 59773, -- 统御铭文
    [3795] = 59777, -- 凯旋秘药
    [3796] = 59778, -- 统御秘药
    [3797] = 59784, -- 统御秘药
    [3806] = 59927, -- 风暴铭文
    [3807] = 59928, -- 峭壁铭文
    [3808] = 59934, -- 强效利斧铭文
    [3809] = 59936, -- 强效峭壁铭文
    [3810] = 59937, -- 强效风暴铭文
    [3811] = 59941, -- 强效巅峰铭文
    [3812] = 59944, -- 结霜之魂秘药
    [3813] = 59945, -- 剧毒防护秘药
    [3814] = 59946, -- 流离之影秘药
    [3815] = 59947, -- 蚀月秘药
    [3816] = 59948, -- 烈焰之魂秘药
    [3817] = 59954, -- 折磨秘药
    [3818] = 59955, -- 坚定守护者秘药
    [3819] = 59960, -- 祝福治愈秘药
    [3820] = 59970, -- 燃烧之谜秘药
    [3822] = 60581, -- 霜皮腿甲片
    [3823] = 60582, -- 冰鳞腿甲片
    [3824] = 60606, -- 附魔靴子 - 突袭
    [3825] = 60609, -- 附魔披风 - 速度
    [3826] = 60623, -- 附魔靴子 - 履冰
    [3827] = 60691, -- 附魔双手武器 - 杀戮
    [3828] = 44630, -- 附魔双手武器 - 强效野蛮
    [3829] = 44513, -- 附魔手套 - 强效突袭
    [3830] = 44629, -- 附魔武器 - 优异法术能量
    [3831] = 47898, -- 附魔披风 - 强效速度
    [3832] = 60692, -- 附魔胸甲 - 强力属性
    [3833] = 60707, -- 附魔武器 - 超强潜能
    [3834] = 60714, -- 附魔武器 - 极效法术能量
    [3835] = 61117, -- 大师的利斧铭文
    [3836] = 61118, -- 大师的峭壁铭文
    [3837] = 61119, -- 大师的巅峰铭文
    [3838] = 61120, -- 大师的风暴铭文
    [3839] = 44645, -- 附魔戒指 - 突袭
    [3840] = 44636, -- 附魔戒指 - 强效法术能量
    [3842] = 61271, -- 凶残角斗士秘药
    [3843] = 61468, -- 钻石折射瞄准镜
    [3844] = 44510, -- 附魔武器 - 优异精神
    [3845] = 44575, -- 附魔护腕 - 强效突袭
    [3846] = 34010, -- 附魔武器 - 特效治疗
    [3847] = 62158, -- 石肤石像鬼符文
    [3849] = 62201, -- 泰坦神铁护板
    [3850] = 62256, -- 附魔护腕 - 特效耐力
    [3851] = 62257, -- 附魔武器 - 泰坦护卫
    [3852] = 62384, -- 强效角斗士铭文
    [3853] = 62447, -- 土灵腿甲片
    [3854] = 62948, -- 附魔法杖 - 强效法术能量
    [3855] = 62959, -- 附魔法杖 - 法术能量
    [3858] = 63746, -- 附魔靴子 - 次级精确
    [3859] = 63765, -- 弹力蛛丝
    [3860] = 63770, -- 装甲护网
    [3869] = 64441, -- 附魔武器 - 利刃防护
    [3870] = 64579, -- 附魔武器 - 吸血
    [3872] = 56039, -- 神圣魔线
    [3873] = 56034, -- 大师的魔线
    [3875] = 59929, -- 利斧铭文
    [3876] = 59932, -- 巅峰铭文
    [3878] = 67839, -- 思维放大圆盘
    [3883] = 70164, -- 蛛魔甲壳符文

    -- [241] = 7745, -- 附魔双手武器 - 初级冲击
    [241] = 13503, -- 附魔武器 - 次级攻击
    [910] = 25083, -- 附魔披风 - 潜行
    -- [910] = 359640, -- 附魔披风 - 潜行
    [926] = 13933, -- 附魔盾牌 - 冰霜抗性
    -- [926] = 359895, -- 附魔盾牌 - 冰霜抗性
    -- [943] = 13529, -- 附魔双手武器 - 次级冲击
    [943] = 13693, -- 附魔武器 - 攻击
    -- [963] = 13937, -- 附魔双手武器 - 强效冲击
    [963] = 27967, -- 附魔武器 - 特效打击
    [1119] = 44555, -- 附魔护腕 - 优异智力
    -- [1119] = 47715, -- 附魔模板
    [1593] = 34002, -- 附魔护腕 - 突袭
    -- [1593] = 359639, -- 附魔护腕 - 突袭
    -- [1897] = 13695, -- 附魔双手武器 - 冲击
    [1897] = 20031, -- 附魔武器 - 超强打击
    [1898] = 20032, -- 附魔武器 - 生命吸取
    -- [1898] = 27964, -- 附魔武器 - 特效精神
    [2523] = 22779, -- 比兹尼克247x128精确瞄准镜
    -- [2523] = 30255, -- 稳定恒金瞄准镜
    [2567] = 23803, -- 附魔武器 - 强效精神
    -- [2567] = 359642, -- 附魔武器 - 强效精神
    [2613] = 25072, -- 附魔手套 - 威胁
    -- [2613] = 359858, -- 附魔手套 - 威胁
    [2619] = 25081, -- 附魔披风 - 强效火焰抗性
    -- [2619] = 359950, -- 附魔披风 - 强效火焰抗性
    [2620] = 25082, -- 附魔披风 - 强效自然抗性
    -- [2620] = 359949, -- 附魔披风 - 强效自然抗性
    [2621] = 25084, -- 附魔披风 - 狡诈
    -- [2621] = 359847, -- 附魔披风 - 狡诈
    -- [2650] = 23802, -- 附魔护腕 - 治疗能力
    -- [2650] = 27911, -- 附魔护腕 - 超强治疗
    [2650] = 27917, -- 附魔护腕 - 法术能量
    -- [2724] = 30258, -- 稳定恒金瞄准镜
    [2724] = 30260, -- 稳定恒金瞄准镜
    [3229] = 44383, -- 附魔盾牌 - 韧性
    -- [3229] = 359685, -- 附魔盾牌 - 抗性
    -- [3289] = 48555, -- 碎天者之鞭
    -- [3289] = 48557, -- 马鞭
    -- [3289] = 47103, -- 马鞭
    -- [3315] = 48401, -- 棍子上的胡萝卜
    -- [3315] = 48556, -- 棍子上的胡萝卜
    -- [3327] = 50903, -- 冰虫腿甲强化片
    [3327] = 60583, -- 冰虫腿甲强化片
    -- [3328] = 50904, -- 蛛魔腿甲强化片
    [3328] = 60584, -- 蛛魔腿甲强化片
}

local EnchantMultiSpellDB = {
    [41] = {
        [5] = 7420, -- 附魔胸甲 - 初级生命
        [9] = 7418 -- 附魔护腕 - 初级生命
    },
    [66] = {
        [8] = 7863, -- 附魔靴子 - 初级耐力
        [9] = 7457, -- 附魔护腕 - 初级耐力
        [17] = 13378 -- 附魔盾牌 - 初级耐力
    },
    [247] = {
        [8] = 7867, -- 附魔靴子 - 初级敏捷
        [9] = 7779, -- 附魔护腕 - 初级敏捷
        [15] = 13419 -- 附魔披风 - 初级敏捷
    },
    [255] = {
        [9] = 7859, -- 附魔护腕 - 次级精神
        [16] = 13380, -- 附魔双手武器 - 次级精神
        [17] = 13485, -- 附魔盾牌 - 次级精神
        [8] = 13687 -- 附魔靴子 - 次级精神
    },
    [723] = {
        [16] = 7793, -- 附魔双手武器 - 次级智力
        [9] = 13622 -- 附魔护腕 - 次级智力
    },
    [724] = {
        [17] = 13631, -- 附魔盾牌 - 次级耐力
        [9] = 13501, -- 附魔护腕 - 次级耐力
        [8] = 13644 -- 附魔靴子 - 次级耐力
    },
    [846] = {
        [16] = 24302, -- 恒金渔线
        [10] = 71692 -- 附魔手套 - 垂钓
    },
    [848] = {
        [15] = 13635, -- 附魔披风 - 防御
        [17] = 13464 -- 附魔盾牌 - 次级防护
    },
    [849] = {
        [8] = 13637, -- 附魔靴子 - 次级敏捷
        [15] = 13882 -- 附魔披风 - 次级敏捷
    },
    [851] = {
        [9] = 13642, -- 附魔护腕 - 精神
        [17] = 13659, -- 附魔盾牌 - 精神
        [8] = 20024 -- 附魔靴子 - 精神
    },
    [852] = {
        [9] = 13648, -- 附魔护腕 - 耐力
        [17] = 13817, -- 附魔盾牌 - 耐力
        [8] = 13836 -- 附魔靴子 - 耐力
    },
    [856] = {
        [10] = 13887, -- 附魔手套 - 力量
        [9] = 13661 -- 附魔护腕 - 力量
    },
    [904] = {
        [8] = 13935, -- 附魔靴子 - 敏捷
        [10] = 13815 -- 附魔手套 - 敏捷
    },
    [907] = {
        [17] = 13905, -- 附魔盾牌 - 强效精神
        [9] = 13846 -- 附魔护腕 - 强效精神
    },
    [927] = {
        [9] = 13939, -- 附魔护腕 - 强效力量
        [10] = 20013 -- 附魔手套 - 强效力量
    },
    [929] = {
        [9] = 13945, -- 附魔护腕 - 强效耐力
        [17] = 20017, -- 附魔盾牌 - 强效耐力
        [8] = 20020 -- 附魔靴子 - 强效耐力
    },
    [983] = {
        [15] = 44500, -- 附魔披风 - 超强敏捷
        [8] = 44589 -- 附魔靴子 - 超强敏捷
    },
    [1147] = {
        [9] = 44593, -- 附魔护腕 - 特效精神
        [8] = 44508 -- 附魔靴子 - 强效精神
    },
    [1887] = {
        [10] = 20012, -- 附魔手套 - 强效敏捷
        [8] = 20023 -- 附魔靴子 - 强效敏捷
    },
    [1888] = {
        [15] = 20014, -- 附魔披风 - 强效抗性
        [17] = 27947 -- 附魔盾牌 - 抗性
    },
    [1891] = {
        [5] = 20025, -- 附魔胸甲 - 强效属性
        [9] = 27905 -- 附魔护腕 - 属性
    },
    [1951] = {
        [5] = 46594, -- 附魔胸甲 - 防御
        [15] = 44591 -- 附魔披风 - 泰坦之纹
    },
    [2564] = {
        [16] = 23800, -- 附魔武器 - 敏捷
        [17] = 23800, -- 附魔武器 - 敏捷
        [10] = 25080, -- 附魔手套 - 超强敏捷
        -- [10] = 359641 -- 附魔手套 - 超强敏捷
    },
    [2648] = {
        [9] = 27906, -- 附魔护腕 - 特效防御
        [15] = 47051 -- 附魔披风 - 钢纹
    },
    [2649] = {
        [9] = 27914, -- 附魔护腕 - 坚韧
        [8] = 27950 -- 附魔长靴 - 坚韧
    },
    [2661] = {
        [5] = 27960, -- 附魔胸甲 - 优异属性
        [9] = 44616 -- 附魔护腕 - 强效属性
    },
    [3222] = {
        [16] = 42620, -- 附魔武器 - 强效敏捷
        [17] = 42620, -- 附魔武器 - 强效敏捷
        [10] = 44529 -- 附魔手套 - 特效敏捷
    },
    [3231] = {
        [10] = 44484, -- 附魔手套 - 精准
        [9] = 44598 -- 附魔护腕 - 精准
    }
}

function lib:GetEnchantInfo(link, slotID)
    local enchantID = tonumber(string.match(link, "item:%d+:(%d+):"))
    if not enchantID then
        return nil, nil, nil
    end
    local enchantItemID = EnchantItemDB[enchantID]
    local enchantSpellID = EnchantMultiSpellDB[enchantID] and EnchantMultiSpellDB[enchantID][slotID] or EnchantSpellDB[enchantID]
    return enchantItemID, enchantSpellID, enchantID
end

if not (C_Engraving and C_Engraving.IsEngravingEnabled()) then return end

local EnchantRuneDB
local locale = GetLocale()
-- GENERATE BY https://wago.tools/db2/SpellItemEnchantment?build=1.15.1.53247
-- TODO: 双武器专精, 盾牌精通, 超載(zhTW)
if (locale == "enUS" or locale == "enGB") then
    EnchantRuneDB = {["Deadly Brew"] = 399969, ["Between the Eyes"] = 400033, ["Just a Flesh Wound"] = 400039, ["Return to the Shadows"] = 400030, ["Tricks of the Trade"] = 400035, ["Cheat Death"] = 400036, ["Rolling with the Punches"] = 400040, ["Mutilate"] = 399962, ["Quick Draw"] = 398197, ["Shuriken Toss"] = 400032, ["Blade Dance"] = 400038, ["Shadowstrike"] = 400031, ["Arcane Barrage"] = 401719, ["Hot Streak"] = 401724, ["Brain Freeze"] = 401725, ["Advanced Warding"] = 401726, ["Spellfrost Orb"] = 401727, ["Arcane Blast"] = 401729, ["Burnout"] = 415460, ["Ice Lance"] = 401732, ["Rewind Time"] = 401734, ["Frostfire Bolt"] = 401735, ["Missile Barrage"] = 401736, ["Overheat"] = 401737, ["Fingers of Frost"] = 401741, ["Regeneration"] = 401743, ["Living Flame"] = 401744, ["Prayer of Mending"] = 402832, ["Shadow Word: Death"] = 402833, ["Soul Warding"] = 402834, ["Light and Dark"] = 402835, ["Homunculi"] = 402836, ["Binding Heal"] = 402837, ["Shared Pain"] = 402838, ["Pain Suppression"] = 402839, ["Atonement"] = 402840, ["Vampiric Touch"] = 402841, ["Circle of Healing"] = 402842, ["Shadowfiend"] = 402843, ["Penance"] = 402844, ["Black and White"] = 402845, ["Eye of the Void"] = 402846, ["Shadowstep"] = 400037, ["Envenom"] = 399968, ["Commanding Shout"] = 403435, ["Enraged Regeneration"] = 403359, ["Victory Rush"] = 403434, ["Meathook"] = 403436, ["Intervene"] = 403437, ["Flagellation"] = 403344, ["Drill Master"] = 403347, ["Nullification"] = 403348, ["Endless Rage"] = 403349, ["Heroic Leap"] = 403350, ["Blood Frenzy"] = 403352, ["Devastate"] = 403355, ["Furious Thunder"] = 403356, ["Heroic Throw"] = 403357, ["Haunt"] = 403858, ["Demonic Circle"] = 403859, ["Chaos Bolt"] = 403860, ["Clarity of Pain"] = 403861, ["Amplification"] = 403862, ["Soul Siphon"] = 403863, ["Fel Armor"] = 403864, ["Soul Leech"] = 403866, ["Master Channeler"] = 403868, ["Harvest of Souls"] = 403869, ["Seed of Corruption"] = 403870, ["Shadow Bolt Volley"] = 403871, ["Lake of Fire"] = 403872, ["Metamorphosis"] = 403873, ["Grant Life"] = 403874, ["Titan's Grip"] = 415591, ["Focused Rage"] = 415745, ["Annihilator"] = 409073, ["Beacon of Light"] = 409906, ["Hand of Reckoning"] = 409911, ["Crusader Strike"] = 409914, ["Flagellant's Whip"] = 409916, ["Death Strike"] = 409917, ["Divine Plea"] = 409919, ["Hammer of the Righteous"] = 409922, ["Divine Storm"] = 409924, ["Seal of Martyrdom"] = 409925, ["Desecration"] = 409929, ["Aura Mastery"] = 409932, ["Avenger's Shield"] = 409933, ["Avenging Wrath"] = 409934, ["Divine Sacrifice"] = 409935, ["Inspiration Exemplar"] = 409936, ["Wild Strikes"] = 409805, ["Survival Instincts"] = 409809, ["Wild Growth"] = 409810, ["Improved Frenzied Regeneration"] = 431458, ["Nurturing Instinct"] = 409816, ["Savage Roar"] = 409819, ["Savage Defense"] = 409822, ["Lifebloom"] = 409824, ["Force of Nature"] = 409825, ["Nature's Fury"] = 409826, ["Mangle"] = 409828, ["Grove Defender"] = 409829, ["Nourish"] = 409830, ["Dreamstate"] = 409831, ["Fury of Stormrage"] = 409832, ["Fire Nova"] = 409938, ["Dual Wield Specialization"] = 409940, ["Water Shield"] = 409941, ["Shield Mastery"] = 409943, ["Ancestral Guidance"] = 409944, ["Overload"] = 409945, ["Maelstrom Weapon"] = 409946, ["Earth Shield"] = 409947, ["Astral Shift"] = 409949, ["Spirit of the Alpha"] = 409951, ["Lava Burst"] = 409952, ["Lava Lash"] = 409953, ["Riptide"] = 409954, ["Way of Earth"] = 409955, ["Thunderstorm"] = 409956, ["Steady Shot"] = 409957, ["Master Marksman"] = 409958, ["Expose Weakness"] = 409959, ["Heart of the Lion"] = 409960, ["Beast Mastery"] = 409962, ["Misdirection"] = 409967, ["Trap Launcher"] = 409968, ["Camouflage"] = 409971, ["Harpoon"] = 409972, ["Kill Command"] = 409974, ["Chimera Shot"] = 409976, ["Explosive Shot"] = 409978, ["Lone Wolf"] = 409979, ["Long Reach"] = 409981, ["Crimson Tempest"] = 436611, ["Leeching Poisons"] = 415724, ["Black Powder"] = 415453, ["Waylay"] = 415725, ["Cannonball Barrage"] = 415454, ["Swift Kick"] = 415726, ["Fleet Footed"] = 415456, ["Crimson Vial"] = 415727, ["Blunderbuss"] = 436610, ["Recuperate"] = 415728, ["Spell Power"] = 415459, ["Enlightenment"] = 415729, ["Living Bomb"] = 401731, ["Ignition"] = 415730, ["Empowered Frostbolt"] = 415466, ["Summon Water Elemental"] = 412442, ["Mass Regeneration"] = 415467, ["Temporal Echoes"] = 415733, ["Melt"] = 415470, ["Spellfrost Bolt"] = 415734, ["Body and Soul"] = 415480, ["Serendipity"] = 415737, ["Pain and Suffering"] = 415481, ["Mind Sear"] = 415738, ["Rapture"] = 415482, ["Strength of Soul"] = 415740, ["Mastermind"] = 415483, ["Shadow and Light"] = 415741, ["Dark Ritual"] = 415484, ["Corpse Explosion"] = 415742, ["Blood Surge"] = 415743, ["Two-Handed Specialist"] = 415593, ["Precise Timing"] = 415744, ["Gladiator Stance"] = 415598, ["Breakthrough"] = 415746, ["Single-Minded Fury"] = 415599, ["Longbowman"] = 415747, ["Everlasting Affliction"] = 415604, ["Power Bargain"] = 415748, ["Demonic Tactics"] = 415605, ["Demonic Knowledge"] = 415749, ["Fire and Brimstone"] = 415606, ["Incinerate"] = 415750, ["Forbidden Knowledge"] = 415609, ["Dance of the Wicked"] = 415751, ["Font of Life"] = 415610, ["Soul Sacrifice"] = 415752, ["Sacred Shield"] = 415703, ["Divine Illumination"] = 415754, ["Ardent Defender"] = 415704, ["Guarded by the Light"] = 415755, ["Augmented Seals"] = 415705, ["Exorcist"] = 415756, ["The Art of War"] = 415706, ["Howling Blast"] = 415707, ["Horn of Winter"] = 415758, ["Swipe (Cat)"] = 415708, ["Skull Bash"] = 415759, ["Survival of the Fittest"] = 415709, ["Lacerate"] = 415760, ["Gift of the Earthmother"] = 415710, ["Living Seed"] = 415761, ["Sunfire"] = 414692, ["Elune's Fires"] = 415762, ["Predatory Swiftness"] = 415711, ["Wild Charge"] = 415763, ["Power Surge"] = 415712, ["Empowered Flames"] = 415764, ["Mental Dexterity"] = 415713, ["Frozen Power"] = 415765, ["Healing Rain"] = 415714, ["Resilient Earth"] = 415715, ["Burn"] = 415768, ["Master of the Elements"] = 415716, ["Ghost World"] = 415815, ["Catlike Reflexes"] = 415717, ["Invigoration"] = 415816, ["Aspect of the Viper"] = 415718, ["Rapid Killing"] = 415817, ["Lock and Load"] = 415719, ["Sniper Training"] = 415818, ["Kill Shot"] = 415720, ["Run and Gun"] = 415819, ["Melee Specialist"] = 415723, ["Raptor Fury"] = 415822, ["Coherence"] = 416081, ["Cyclone"] = 416212, ["Starsurge"] = 424715, ["Berserk"] = 424759, ["King of the Jungle"] = 424762, ["Saber Slash"] = 424979, ["Shiv"] = 424980, ["Main Gauche"] = 424982, ["Slaughter from the Shadows"] = 424983, ["Poisoned Knife"] = 425100, ["Master of Subtlety"] = 425101, ["Icy Veins"] = 425169, ["Arcane Surge"] = 425168, ["Chronostatic Preservation"] = 425187, ["Power Word: Barrier"] = 425212, ["Twisted Faith"] = 425210, ["Void Plague"] = 425211, ["Empowered Renew"] = 425302, ["Renewed Hope"] = 425303, ["Spirit of the Redeemer"] = 425304, ["Dispersion"] = 425307, ["Shamanistic Rage"] = 425341, ["Molten Blast"] = 425340, ["Quick Strike"] = 425428, ["Raging Blow"] = 425429, ["Warbringer"] = 425430, ["Consumed by Rage"] = 425440, ["Frenzied Assault"] = 425442, ["Demonic Pact"] = 425473, ["Demonic Grace"] = 425474, ["Horn of Lordaeron"] = 425614, ["Aegis"] = 425615, ["Rebuke"] = 425616, ["Carve"] = 425754, ["Cobra Strikes"] = 425755, ["Serpent Spread"] = 425756, ["Flanking Strike"] = 425757, ["Decoy Totem"] = 425881, ["Ancestral Awakening"] = 425879, ["Enlightened Judgements"] = 426174, ["Sheath of Light"] = 426176, ["Infusion of Light"] = 426179, ["Invocation"] = 426442, ["Grimoire of Synergy"] = 426444, ["Shadow and Flame"] = 426449, ["Shadowflame"] = 426454, ["Vengeance"] = 426469, ["Rallying Cry"] = 426492, ["Taste for Blood"] = 427067, ["Vigilance"] = 427068, ["Rampage"] = 427070, ["Sword and Board"] = 427073, ["Wrecking Crew"] = 427074, ["Light's Grace"] = 429243, ["Fanaticism"] = 429250, ["Wrath"] = 429248, ["Purifying Power"] = 429254, ["Improved Hammer of Wrath"] = 429259, ["Improved Sanctuary"] = 429245, ["Deep Freeze"] = 429303, ["Temporal Anomaly"] = 429305, ["Molten Armor"] = 429307, ["Displacement"] = 428863, ["Balefire Bolt"] = 429310, ["Gore"] = 431446, ["Improved Barkskin"] = 431448, ["Gale Winds"] = 431450, ["Efflorescence"] = 431466, ["Eclipse"] = 409813, ["Focus Fire"] = 431600, ["T.N.T."] = 431610, ["Divine Aegis"] = 431649, ["Mind Spike"] = 431662, ["Surge of Light"] = 431668, ["Despair"] = 431675, ["Void Zone"] = 431704, ["Pandemic"] = 429283, ["Backdraft"] = 431742, ["Unstable Affliction"] = 431748, ["Summon Felguard"] = 431754, ["Immolation Aura"] = 431757, ["Automatic Crowd Pummeler"] = 432137, ["Wolfshead Trophy"] = 17768, ["Tidal Waves"] = 432233, ["Rolling Thunder"] = 432235, ["Static Shock"] = 432237, ["Overcharged"] = 432240, ["Focused Attacks"] = 432290, ["Combat Potency"] = 432292, ["Honor Among Thieves"] = 432294, ["Cut to the Chase"] = 432296, ["Carnage"] = 432298, ["Unfair Advantage"] = 432300, ["Dismantle"] = 435467, ["Retricutioner"] = 435901, ["Two-Handed Mastery"] = 436367, ["Fan of Knives"] = 436608, }
elseif locale == "zhCN" then
    EnchantRuneDB = {["致命阴谋"] = 399969, ["正中眉心"] = 400033, ["只是皮肉伤"] = 400039, ["回归暗影"] = 400030, ["嫁祸诀窍"] = 400035, ["装死"] = 400036, ["闪转腾挪"] = 400040, ["毁伤"] = 399962, ["速射"] = 398197, ["飞镖投掷"] = 400032, ["刃舞"] = 400038, ["暗影打击"] = 400031, ["奥术弹幕"] = 401719, ["炽热连击"] = 401724, ["冰冷智慧"] = 401725, ["进阶结界"] = 401726, ["法术冰霜宝珠"] = 401727, ["奥术冲击"] = 401729, ["燃尽"] = 415460, ["冰枪术"] = 401732, ["时光倒转"] = 401734, ["霜火之箭"] = 401735, ["飞弹连射"] = 401736, ["过热"] = 401737, ["寒冰指"] = 401741, ["再生"] = 401743, ["活体烈焰"] = 401744, ["愈合祷言"] = 402832, ["暗言术：灭"] = 402833, ["灵魂守护"] = 402834, ["光暗相生"] = 402835, ["裂魂魔"] = 402836, ["联结治疗"] = 402837, ["分担痛苦"] = 402838, ["痛苦压制"] = 402839, ["救赎"] = 402840, ["吸血鬼之触"] = 402841, ["治疗之环"] = 402842, ["暗影魔"] = 402843, ["苦修"] = 402844, ["黑与白"] = 402845, ["虚空之眼"] = 402846, ["暗影步"] = 400037, ["毒伤"] = 399968, ["命令怒吼"] = 403435, ["狂怒回复"] = 403359, ["乘胜追击"] = 403434, ["肉钩"] = 403436, ["援护"] = 403437, ["狂热鞭笞"] = 403344, ["练兵大师"] = 403347, ["废灵"] = 403348, ["无尽怒气"] = 403349, ["英勇飞跃"] = 403350, ["血之狂暴"] = 403352, ["毁灭打击"] = 403355, ["狂怒雷霆"] = 403356, ["英勇投掷"] = 403357, ["鬼影缠身"] = 403858, ["恶魔法阵"] = 403859, ["混乱之箭"] = 403860, ["痛苦顿悟"] = 403861, ["增效"] = 403862, ["灵魂虹吸"] = 403863, ["邪甲术"] = 403864, ["灵魂榨取"] = 403866, ["引导大师"] = 403868, ["灵魂收割"] = 403869, ["腐蚀之种"] = 403870, ["暗影箭雨"] = 403871, ["火焰之湖"] = 403872, ["恶魔变形"] = 403873, ["赐予生命"] = 403874, ["泰坦之握"] = 415591, ["怒火聚焦"] = 415745, ["歼灭者"] = 409073, ["圣光道标"] = 409906, ["清算之手"] = 409911, ["十字军打击"] = 409914, ["自笞者之鞭"] = 409916, ["灵界打击"] = 409917, ["神圣恳求"] = 409919, ["正义之锤"] = 409922, ["神圣风暴"] = 409924, ["殉道圣印"] = 409925, ["渎圣"] = 409929, ["光环掌握"] = 409932, ["复仇者之盾"] = 409933, ["复仇之怒"] = 409934, ["神圣牺牲"] = 409935, ["激励典范"] = 409936, ["狂野打击"] = 409805, ["生存本能"] = 409809, ["野性成长"] = 409810, ["强化狂暴回复"] = 431458, ["治愈本能"] = 409816, ["野蛮咆哮"] = 409819, ["野蛮防御"] = 409822, ["生命绽放"] = 409824, ["自然之力"] = 409825, ["自然之怒"] = 409826, ["割碎"] = 409828, ["林地防御者"] = 409829, ["滋养"] = 409830, ["迷梦"] = 409831, ["怒风之怒"] = 409832, ["火焰新星"] = 409938, ["双武器专精"] = 409940, ["水之护盾"] = 409941, ["盾牌精通"] = 409943, ["先祖指引"] = 409944, ["过载"] = 409945, ["漩涡武器"] = 409946, ["大地之盾"] = 409947, ["星界转移"] = 409949, ["头狼之魂"] = 409951, ["熔岩爆裂"] = 409952, ["熔岩猛击"] = 409953, ["激流"] = 409954, ["土之道"] = 409955, ["雷霆风暴"] = 409956, ["稳固射击"] = 409957, ["神射手"] = 409958, ["破甲虚弱"] = 409959, ["雄狮之心"] = 409960, ["野兽控制"] = 409962, ["误导"] = 409967, ["陷阱发射器"] = 409968, ["伪装"] = 409971, ["鱼叉猛刺"] = 409972, ["杀戮命令"] = 409974, ["奇美拉射击"] = 409976, ["爆炸射击"] = 409978, ["独来独往"] = 409979, ["触手可及"] = 409981, ["猩红风暴"] = 436611, ["吸血毒药"] = 415724, ["黑火药"] = 415453, ["埋伏"] = 415725, ["炮弹弹幕"] = 415454, ["迅猛脚踢"] = 415726, ["健步如飞"] = 415456, ["猩红之瓶"] = 415727, ["短枪射击"] = 436610, ["复原"] = 415728, ["法术强权"] = 415459, ["启迪"] = 415729, ["活动炸弹"] = 401731, ["点火"] = 415730, ["强化寒冰箭"] = 415466, ["召唤水元素"] = 412442, ["群体再生"] = 415467, ["时光回响"] = 415733, ["熔化"] = 415470, ["法术冰霜箭"] = 415734, ["身心合一"] = 415480, ["妙手回春"] = 415737, ["饱受折磨"] = 415481, ["精神灼烧"] = 415738, ["全神贯注"] = 415482, ["灵魂之力"] = 415740, ["神机妙算"] = 415483, ["光影交错"] = 415741, ["黑暗仪式"] = 415484, ["邪爆"] = 415742, ["血涌"] = 415743, ["双手专家"] = 415593, ["精准猛击"] = 415744, ["角斗姿态"] = 415598, ["突破"] = 415746, ["鲁莽怒火"] = 415599, ["长弓手"] = 415747, ["持久痛苦"] = 415604, ["强权交易"] = 415748, ["恶魔战术"] = 415605, ["恶魔知识"] = 415749, ["硫磺烈火"] = 415606, ["烧尽"] = 415750, ["禁断知识"] = 415609, ["堕落之舞"] = 415751, ["生命之池"] = 415610, ["灵魂献祭"] = 415752, ["圣洁护盾"] = 415703, ["神启"] = 415754, ["炽热防御者"] = 415704, ["圣光守护"] = 415755, ["强化圣印"] = 415705, ["驱魔人"] = 415756, ["战争艺术"] = 415706, ["凛风冲击"] = 415707, ["寒冬号角"] = 415758, ["横扫（豹）"] = 415708, ["迎头痛击"] = 415759, ["优胜劣汰"] = 415709, ["割伤"] = 415760, ["大地母亲的恩赐"] = 415710, ["生命之种"] = 415761, ["阳炎术"] = 414692, ["艾露恩之火"] = 415762, ["掠食者的迅捷"] = 415711, ["狂野冲锋"] = 415763, ["能量涌动"] = 415712, ["强能烈焰"] = 415764, ["聪慧"] = 415713, ["冰霜之力"] = 415765, ["治疗之雨"] = 415714, ["韧性之土"] = 415715, ["燃烧"] = 415768, ["元素宗师"] = 415716, ["幽魂世界"] = 415815, ["猎豹敏捷"] = 415717, ["鼓舞"] = 415816, ["蝰蛇守护"] = 415718, ["疾速杀戮"] = 415817, ["荷枪实弹"] = 415719, ["狙击训练"] = 415818, ["夺命射击"] = 415720, ["跑轰战术"] = 415819, ["近战专家"] = 415723, ["猛禽之怒"] = 415822, ["连贯链条"] = 416081, ["旋风"] = 416212, ["星涌术"] = 424715, ["狂暴"] = 424759, ["丛林之王"] = 424762, ["军刀猛刺"] = 424979, ["毒刃"] = 424980, ["左右开弓"] = 424982, ["暗影杀手"] = 424983, ["剧毒之刃"] = 425100, ["敏锐大师"] = 425101, ["冰冷血脉"] = 425169, ["奥术涌动"] = 425168, ["凝时恩护"] = 425187, ["真言术：障"] = 425212, ["扭曲信仰"] = 425210, ["虚空疫病"] = 425211, ["恢复增效"] = 425302, ["新生希望"] = 425303, ["救赎者之魂"] = 425304, ["消散"] = 425307, ["萨满之怒"] = 425341, ["熔火爆裂"] = 425340, ["迅捷打击"] = 425428, ["怒击"] = 425429, ["战神"] = 425430, ["噬心狂怒"] = 425440, ["狂乱攻击"] = 425442, ["恶魔契约"] = 425473, ["恶魔优雅"] = 425474, ["洛丹伦号角"] = 425614, ["神盾"] = 425615, ["责难"] = 425616, ["削凿"] = 425754, ["眼镜蛇打击"] = 425755, ["毒蛇扩散"] = 425756, ["侧翼打击"] = 425757, ["诱饵图腾"] = 425881, ["先祖复苏"] = 425879, ["开明审判"] = 426174, ["圣光出鞘"] = 426176, ["圣光灌注"] = 426179, ["祈告"] = 426442, ["协同魔典"] = 426444, ["影与焰"] = 426449, ["暗影烈焰"] = 426454, ["复仇"] = 426469, ["集结呐喊"] = 426492, ["血之气息"] = 427067, ["警戒"] = 427068, ["暴怒"] = 427070, ["剑盾猛攻"] = 427073, ["破坏能手"] = 427074, ["光之优雅"] = 429243, ["狂信"] = 429250, ["愤怒"] = 429248, ["净化之力"] = 429254, ["强化愤怒之锤"] = 429259, ["强化庇护"] = 429245, ["深度冻结"] = 429303, ["时空畸体"] = 429305, ["熔岩护甲"] = 429307, ["闪回"] = 428863, ["怨火之箭"] = 429310, ["淤血"] = 431446, ["强化树皮术"] = 431448, ["烈风"] = 431450, ["百花齐放"] = 431466, ["日月之蚀"] = 409813, ["集中火力"] = 431600, ["T.N.T."] = 431610, ["神圣庇护"] = 431649, ["心灵尖刺"] = 431662, ["圣光涌动"] = 431668, ["绝望"] = 431675, ["虚空领域"] = 431704, ["恶疾"] = 429283, ["爆燃"] = 431742, ["痛苦无常"] = 431748, ["召唤恶魔卫士"] = 431754, ["献祭光环"] = 431757, ["自动群体打击者"] = 432137, ["狼首战利品"] = 17768, ["潮汐奔涌"] = 432233, ["滚雷"] = 432235, ["静电震击"] = 432237, ["能量超载"] = 432240, ["专注攻击"] = 432290, ["作战潜能"] = 432292, ["盗贼的尊严"] = 432294, ["穷追猛砍"] = 432296, ["诛灭"] = 432298, ["压倒优势"] = 432300, ["拆卸"] = 435467, ["惩刑人"] = 435901, ["双手精通"] = 436367, ["刀扇"] = 436608, }
elseif locale == "zhTW" then
    EnchantRuneDB = {["致命毒釀"] = 399969, ["正中眉心"] = 400033, ["不過是點皮肉傷"] = 400039, ["回到暗影之中"] = 400030, ["偷天換日"] = 400035, ["死亡謊言"] = 400036, ["重拳連發"] = 400040, ["截肢"] = 399962, ["拔槍快手"] = 398197, ["手裏劍"] = 400032, ["劍刃之舞"] = 400038, ["暗影打擊"] = 400031, ["秘法彈幕"] = 401719, ["熱門連勝"] = 401724, ["腦部凍結"] = 401725, ["進階結界"] = 401726, ["法霜寶珠"] = 401727, ["秘法衝擊"] = 401729, ["燃盡"] = 415460, ["冰霜長矛"] = 401732, ["時光倒流"] = 401734, ["霜火箭"] = 401735, ["飛彈彈幕"] = 401736, ["過熱"] = 401737, ["冰霜之指"] = 401741, ["再生"] = 401743, ["活化烈焰"] = 401744, ["癒合禱言"] = 402832, ["暗言術：死"] = 402833, ["靈魂結界"] = 402834, ["光與暗"] = 402835, ["魔胎"] = 402836, ["束縛治療"] = 402837, ["共享苦痛"] = 402838, ["痛苦鎮壓"] = 402839, ["贖罪"] = 402840, ["吸血之觸"] = 402841, ["治療之環"] = 402842, ["暗影惡魔"] = 402843, ["懺悟"] = 402844, ["是非黑白"] = 402845, ["虛無之眼"] = 402846, ["暗影閃現"] = 400037, ["毒化"] = 399968, ["命令之吼"] = 403435, ["狂怒恢復"] = 403359, ["勝利衝擊"] = 403434, ["肉鉤"] = 403436, ["阻擾"] = 403437, ["鞭策"] = 403344, ["精通鑽鑿"] = 403347, ["歸於虛無"] = 403348, ["無盡狂怒"] = 403349, ["英勇躍擊"] = 403350, ["血之狂暴"] = 403352, ["挫敗"] = 403355, ["盛怒轟雷"] = 403356, ["英勇投擲"] = 403357, ["蝕魂術"] = 403858, ["惡魔法陣"] = 403859, ["混沌箭"] = 403860, ["痛楚清晰"] = 403861, ["法力增幅"] = 403862, ["靈魂虹吸"] = 403863, ["魔化護甲"] = 403864, ["靈魂汲取"] = 403866, ["引導大師"] = 403868, ["靈魂收割"] = 403869, ["腐蝕種子"] = 403870, ["暗影箭雨"] = 403871, ["火焰之湖"] = 403872, ["惡魔化身"] = 403873, ["賦予生命"] = 403874, ["泰坦之握"] = 415591, ["集中怒氣"] = 415745, ["殲滅者"] = 409073, ["聖光信標"] = 409906, ["清算聖禦"] = 409911, ["十字軍聖擊"] = 409914, ["奴役之鞭"] = 409916, ["死亡打擊"] = 409917, ["神性祈求"] = 409919, ["公正之錘"] = 409922, ["神性風暴"] = 409924, ["殉難聖印"] = 409925, ["褻瀆"] = 409929, ["精通光環"] = 409932, ["復仇之盾"] = 409933, ["復仇之怒"] = 409934, ["神性犧牲"] = 409935, ["鼓舞楷模"] = 409936, ["狂野打擊"] = 409805, ["求生本能"] = 409809, ["野性痊癒"] = 409810, ["強化狂暴恢復"] = 431458, ["培育天性"] = 409816, ["兇蠻咆哮"] = 409819, ["兇蠻防禦"] = 409822, ["生命之花"] = 409824, ["自然之力"] = 409825, ["自然烈怒"] = 409826, ["割碎"] = 409828, ["林地防衛者"] = 409829, ["滋補術"] = 409830, ["夢境"] = 409831, ["怒風之怒"] = 409832, ["火焰新星"] = 409938, ["雙武器專精"] = 409940, ["水之盾"] = 409941, ["精通盾牌"] = 409943, ["先祖導引"] = 409944, ["超載"] = 409945, ["氣漩武器"] = 409946, ["大地之盾"] = 409947, ["星界轉移"] = 409949, ["獸群首領之靈"] = 409951, ["熔岩爆發"] = 409952, ["熔岩暴擊"] = 409953, ["激流"] = 409954, ["大地之道"] = 409955, ["雷霆風暴"] = 409956, ["穩固射擊"] = 409957, ["狙擊大師"] = 409958, ["弱點識破"] = 409959, ["雄獅之心"] = 409960, ["野獸控制"] = 409962, ["誤導"] = 409967, ["發動陷阱"] = 409968, ["偽裝"] = 409971, ["魚叉"] = 409972, ["擊殺命令"] = 409974, ["奇美拉射擊"] = 409976, ["爆裂射擊"] = 409978, ["孤狼"] = 409979, ["鞭長能及"] = 409981, ["赤紅風暴"] = 436611, ["吸血毒藥"] = 415724, ["黑火藥"] = 415453, ["埋伏"] = 415725, ["砲彈彈幕"] = 415454, ["無影腳"] = 415726, ["迅足"] = 415456, ["赤紅藥瓶"] = 415727, ["短槍"] = 436610, ["復甦"] = 415728, ["法術能量"] = 415459, ["啟蒙"] = 415729, ["活體爆彈"] = 401731, ["打火鑰匙"] = 415730, ["強力寒冰箭"] = 415466, ["召喚水元素"] = 412442, ["群體恢復"] = 415467, ["時間迴響"] = 415733, ["邁爾特"] = 415470, ["法霜箭"] = 415734, ["身心合一"] = 415480, ["機緣回復"] = 415737, ["苦痛受難"] = 415481, ["心靈烙印"] = 415738, ["狂喜"] = 415482, ["靈魂之力"] = 415740, ["幕後的黑手"] = 415483, ["暗影與聖光"] = 415741, ["黑暗祭儀"] = 415484, ["屍爆術"] = 415742, ["鮮血澎湃"] = 415743, ["雙手武器專家"] = 415593, ["精準時機"] = 415744, ["鬥士姿態"] = 415598, ["突圍"] = 415746, ["一心狂怒"] = 415599, ["長弓手"] = 415747, ["無間痛苦"] = 415604, ["力量交易"] = 415748, ["惡魔策略"] = 415605, ["惡魔知識"] = 415749, ["硫磺與火焰"] = 415606, ["燒盡"] = 415750, ["禁斷的知識"] = 415609, ["邪惡之舞"] = 415751, ["生命之泉"] = 415610, ["靈魂獻祭"] = 415752, ["崇聖護盾"] = 415703, ["神聖啟發"] = 415754, ["忠誠防衛者"] = 415704, ["聖光守護"] = 415755, ["強化聖印"] = 415705, ["驅邪術"] = 415756, ["戰爭藝術"] = 415706, ["凜風衝擊"] = 415707, ["凜冬號角"] = 415758, ["揮擊(獵豹形態)"] = 415708, ["碎顱猛擊"] = 415759, ["適者生存"] = 415709, ["割裂"] = 415760, ["大地之母賜福"] = 415710, ["生命種子"] = 415761, ["日炎術"] = 414692, ["伊露恩之火"] = 415762, ["猛獸迅捷"] = 415711, ["狂野衝鋒"] = 415763, ["能量激增"] = 415712, ["強力烈焰"] = 415764, ["心靈迅敏"] = 415713, ["冰凍之力"] = 415765, ["治癒之雨"] = 415714, ["強韌大地"] = 415715, ["燃燒"] = 415768, ["元素大師"] = 415716, ["鬼魂世界"] = 415815, ["靈貓迅閃"] = 415717, ["精神鼓舞"] = 415816, ["蝮蛇的化身"] = 415718, ["急速殺戮"] = 415817, ["蓄勢待發"] = 415719, ["狙擊訓練"] = 415818, ["擊殺射擊"] = 415720, ["打帶跑戰術"] = 415819, ["近戰專家"] = 415723, ["迅猛龍狂怒"] = 415822, ["協和同調"] = 416081, ["颶風術"] = 416212, ["星湧術"] = 424715, ["狂暴"] = 424759, ["叢林之王"] = 424762, ["刀劍斬擊"] = 424979, ["毒襲"] = 424980, ["左右開弓"] = 424982, ["伏影抹殺"] = 424983, ["塗毒小刀"] = 425100, ["敏銳大師"] = 425101, ["冰寒脈動"] = 425169, ["秘法奔騰"] = 425168, ["時滯存護"] = 425187, ["真言術：壁"] = 425212, ["扭曲信念"] = 425210, ["虛無瘟疫"] = 425211, ["強力恢復"] = 425302, ["嶄新希望"] = 425303, ["救星之靈"] = 425304, ["影散"] = 425307, ["薩滿之怒"] = 425341, ["熔岩爆裂"] = 425340, ["快速打擊"] = 425428, ["狂怒之擊"] = 425429, ["戰爭使者"] = 425430, ["怒火攻心"] = 425440, ["狂暴襲擊"] = 425442, ["惡魔契印"] = 425473, ["魔化恩典"] = 425474, ["羅德隆號角"] = 425614, ["神禦"] = 425615, ["責難"] = 425616, ["橫劈"] = 425754, ["眼鏡蛇之擊"] = 425755, ["蛇毒蔓延"] = 425756, ["側翼攻擊"] = 425757, ["誘餌圖騰"] = 425881, ["先祖復甦"] = 425879, ["啟發審判"] = 426174, ["聖光之鞘"] = 426176, ["聖光灌注"] = 426179, ["祈咒"] = 426442, ["協調魔典"] = 426444, ["暗影與火焰"] = 426449, ["暗影之焰"] = 426454, ["復仇"] = 426469, ["振奮咆哮"] = 426492, ["血腥體驗"] = 427067, ["戒備守護"] = 427068, ["暴怒"] = 427070, ["劍盾合璧"] = 427073, ["破壞專家"] = 427074, ["聖光恩典"] = 429243, ["狂熱"] = 429250, ["憤怒"] = 429248, ["淨化能量"] = 429254, ["強化憤怒之錘"] = 429259, ["強化庇護"] = 429245, ["極度冰凍"] = 429303, ["時空異象"] = 429305, ["炎甲術"] = 429307, ["位移"] = 428863, ["野火箭"] = 429310, ["浴血奮戰"] = 431446, ["強化樹皮術"] = 431448, ["強風"] = 431450, ["生命綻放"] = 431466, ["蝕星蔽月"] = 409813, ["專注射擊"] = 431600, ["黃色炸藥"] = 431610, ["神禦之盾"] = 431649, ["心靈鑽刺"] = 431662, ["光之澎湃"] = 431668, ["絕望"] = 431675, ["虛無區域"] = 431704, ["災疫"] = 429283, ["爆燃"] = 431742, ["痛苦動盪"] = 431748, ["召喚惡魔守衛"] = 431754, ["獻祭光環"] = 431757, ["全自動懲戒錘"] = 432137, ["狼首戰利品"] = 17768, ["治療之潮"] = 432233, ["轟天雷"] = 432235, ["靜電震擊"] = 432237, ["超載"] = 432240, ["會心攻擊"] = 432290, ["作戰潛能"] = 432292, ["盜亦有道"] = 432294, ["急起直追"] = 432296, ["大屠殺"] = 432298, ["卑劣優勢"] = 432300, ["卸除武裝"] = 435467, ["懲戒者"] = 435901, ["雙手精通"] = 436367, ["飛舞刀刃"] = 436608, }
end

function lib:IsEquipmentSlotEngravable(slot)
    if not EnchantRuneDB then return false end

    if not lib.RuneCategories then
        lib.RuneCategories = {}
        C_Engraving.RefreshRunesList()
        for _, categories in ipairs(C_Engraving.GetRuneCategories(false, false)) do
            lib.RuneCategories[categories] = true
        end
    end

    return not not lib.RuneCategories[slot]
end

function lib:GetRuneInfo(unit, slot)
    if not EnchantRuneDB then return end

    local tip = lib.ScanTip
    tip:SetOwner(UIParent, "ANCHOR_NONE")
    tip:SetInventoryItem(unit, slot)
    for i = 2, tip:NumLines() do
        local line = _G[lib.ScanTipName.."TextLeft"..i]
        if not line then break end

        local text = line:GetText()
        local spell = text and EnchantRuneDB[text]
        if spell then
            return text, spell
        end
    end
end