
-------------------------------------
-- 物品附魔信息庫 Author: M
-------------------------------------

local MAJOR, MINOR = "LibItemEnchant.7000", 1
local lib = LibStub:NewLibrary(MAJOR, MINOR)

if not lib then return end

lib.ScanTip = CreateFrame("GameTooltip", "LibItemEnchant_ScanTooltip", nil, "GameTooltipTemplate")
lib.ScanTipName = lib.ScanTip:GetName()

-- GENERATE BY https://wago.tools/db2/ItemEffect
local EnchantItemDB = {
    [15] = 2304, -- 轻型护甲片
    [16] = 2313, -- 中型护甲片
    [17] = 4265, -- 重型护甲片
    [18] = 8173, -- 厚重护甲片
    [30] = 4405, -- 粗制瞄准镜
    [32] = 4406, -- 普通瞄准镜
    [33] = 4407, -- 精确瞄准镜
    [34] = 6043, -- 铁质平衡锤
    [36] = 5421, -- 炽热魔符
    [37] = 6041, -- 钢质武器链
    [43] = 6042, -- 铁质盾刺
    [463] = 7967, -- 秘银盾刺
    [464] = 7969, -- 秘银马刺
    [663] = 10546, -- 致命瞄准镜
    [664] = 10548, -- 狙击瞄准镜
    [1483] = 11622, -- 次级冥思秘药
    [1503] = 11642, -- 次级体质秘药
    [1504] = 11643, -- 次级坚韧秘药
    [1505] = 11644, -- 次级适应秘药
    [1506] = 11645, -- 次级贪婪秘药
    [1507] = 11646, -- 次级贪婪秘药
    [1508] = 11647, -- 次级贪婪秘药
    [1509] = 11648, -- 次级贪婪秘药
    [1510] = 11649, -- 次级贪婪秘药
    [1704] = 12645, -- 瑟银盾刺
    [1843] = 15564, -- 毛皮护甲片
    [2483] = 18169, -- 火焰黎明衬肩
    [2484] = 18170, -- 冰霜黎明衬肩
    [2485] = 18171, -- 奥术黎明衬肩
    [2486] = 18172, -- 自然黎明衬肩
    [2487] = 18173, -- 暗影黎明衬肩
    [2488] = 18182, -- 多彩黎明衬肩
    [2503] = 18251, -- 熔火护甲片
    [2543] = 18329, -- 急速秘药
    [2544] = 18330, -- 专注秘药
    [2545] = 18331, -- 防护秘药
    [2583] = 19782, -- 力量的证明
    [2584] = 19783, -- 调和的徽记
    [2587] = 19786, -- 巫毒的警觉
    [2588] = 19787, -- 魔法的视域
    [2589] = 19788, -- 不祥的妖术
    [2590] = 19789, -- 预言的光环
    [2591] = 19790, -- 灵魂的安抚
    [2604] = 20078, -- 赞达拉宁静徽记
    [2605] = 20076, -- 赞达拉魔精徽记
    [2606] = 20077, -- 赞达拉力量徽记
    [2681] = 22635, -- 野性戒卫
    [2682] = 22636, -- 寒冰戒卫
    [2683] = 22638, -- 暗影戒卫
    [2714] = 23530, -- 魔钢盾刺
    [2715] = 23547, -- 天灾的活力
    [2716] = 23549, -- 天灾的坚韧
    [2717] = 23548, -- 天灾的威严
    [2721] = 23545, -- 天灾的力量
    [2722] = 23764, -- 精金瞄准镜
    [2723] = 23765, -- 氪金瞄准镜
    [2745] = 24275, -- 银色魔线
    [2746] = 24276, -- 金色魔线
    [2747] = 24273, -- 秘法魔线
    [2748] = 24274, -- 符文魔线
    [2792] = 25650, -- 结缔皮护甲片
    [2793] = 25651, -- 守备官的护甲片
    [2794] = 25652, -- 魔导师的护甲片
    [2841] = 34330, -- 厚重结缔皮护甲片
    [2977] = 28882, -- 护卫铭文
    [2978] = 28889, -- 强力护卫铭文
    [2979] = 28878, -- 信仰铭文
    [2980] = 28887, -- 强力信仰铭文
    [2981] = 28881, -- 戒律铭文
    [2982] = 28886, -- 强力戒律铭文
    [2983] = 28885, -- 复仇铭文
    [2984] = 29483, -- 暗影护甲片
    [2985] = 29485, -- 烈焰护甲片
    [2986] = 28888, -- 强力复仇铭文
    [2987] = 29486, -- 冰霜护甲片
    [2988] = 29487, -- 自然护甲片
    [2989] = 29488, -- 奥术护甲片
    [2990] = 28908, -- 骑士铭文
    [2991] = 28911, -- 强力骑士铭文
    [2992] = 28904, -- 神谕铭文
    [2993] = 28912, -- 强力神谕铭文
    [2994] = 28903, -- 宝珠铭文
    [2995] = 28909, -- 强力宝珠铭文
    [2996] = 28907, -- 利刃铭文
    [2997] = 28910, -- 强力利刃铭文
    [2998] = 29187, -- 耐久铭文
    [2999] = 29186, -- 防御者秘药
    [3001] = 29189, -- 恢复秘药
    [3002] = 29191, -- 强能秘药
    [3003] = 29192, -- 凶暴秘药
    [3004] = 29193, -- 角斗士秘药
    [3005] = 29194, -- 自然防护秘药
    [3006] = 29195, -- 奥术防护秘药
    [3007] = 29196, -- 火焰防护秘药
    [3008] = 29198, -- 冰霜防护秘药
    [3009] = 29199, -- 暗影防护秘药
    [3010] = 29533, -- 眼镜蛇皮腿甲片
    [3011] = 29534, -- 裂蹄腿甲片
    [3012] = 29535, -- 虚空毒蛇腿甲片
    [3013] = 29536, -- 虚空裂蹄腿甲片
    [3095] = 30845, -- 多彩防护秘药
    [3096] = 30846, -- 流放者秘药
    [3223] = 33185, -- 精金武器链
    [3260] = 34207, -- 手套强化护甲片
    [3269] = 34836, -- 真银渔线
    [3290] = 39300, -- 弹簧披风扩张器
    [3325] = 38371, -- 冰虫腿甲片
    [3326] = 38372, -- 蛛魔腿甲片
    [3329] = 38375, -- 北地护甲片
    [3330] = 38376, -- 厚北地护甲片
    [3331] = 38377, -- 龙鳞腿甲片
    [3332] = 38378, -- 巨龙鳞腿甲片
    [3599] = 40776, -- 单兵电磁脉冲发生器
    [3601] = 40800, -- 远距离侦测腰带夹
    [3603] = 41091, -- 手部火箭发射器
    [3605] = 41111, -- 高弹力衬垫
    [3606] = 41118, -- 硝化甘油推进器
    [3607] = 41146, -- 太阳瞄准镜
    [3608] = 41167, -- 觅心瞄准镜
    [3718] = 41601, -- 闪光魔线
    [3719] = 41602, -- 辉煌魔线
    [3720] = 41603, -- 碧蓝魔线
    [3721] = 41604, -- 天蓝魔线
    [3731] = 41976, -- 泰坦神铁武器链
    [3748] = 42500, -- 泰坦神铁盾刺
    [3754] = 19785, -- 猎鹰的召唤
    [3755] = 19784, -- 死亡的拥抱
    [3756] = 43097, -- 毛皮衬垫 - 攻击强度
    [3775] = 43302, -- 铁律铭文
    [3776] = 43303, -- 霜刃铭文
    [3777] = 43304, -- 王者铭文
    [3794] = 44068, -- 统御铭文
    [3797] = 44075, -- 统御秘药
    [3806] = 44129, -- 次级风暴铭文
    [3807] = 44130, -- 次级峭壁铭文
    [3808] = 44133, -- 强效利斧铭文
    [3809] = 44134, -- 强效峭壁铭文
    [3810] = 44135, -- 强效风暴铭文
    [3811] = 44136, -- 强效巅峰铭文
    [3812] = 44137, -- 冰霜之魂秘药
    [3813] = 44138, -- 防毒秘药
    [3814] = 44139, -- 消散之影秘药
    [3815] = 44140, -- 月食秘药
    [3816] = 44141, -- 烈焰之魂秘药
    [3817] = 44149, -- 折磨秘药
    [3818] = 44150, -- 坚定防御者秘药
    [3819] = 44152, -- 祝福治愈秘药
    [3820] = 44159, -- 燃烧谜团秘药
    [3822] = 38373, -- 霜皮腿甲片
    [3823] = 38374, -- 冰鳞腿甲片
    [3842] = 44701, -- 凶残角斗士秘药
    [3843] = 44739, -- 钻石折射瞄准镜
    [3849] = 44936, -- 泰坦神铁护板
    [3852] = 44957, -- 强效角斗士铭文
    [3853] = 44963, -- 土灵腿甲片
    [3875] = 44131, -- 次级利斧铭文
    [3876] = 44132 -- 次级巅峰铭文
}

-- GENERATE BY https://wago.tools/db2/SpellEffect
local EnchantSpellDB = {
    [1] = 2605, -- 打磨利刃
    [15] = 2831, -- 护甲 +8
    [16] = 2832, -- 护甲 +16
    [17] = 2833, -- 护甲 +24
    [18] = 10344, -- 护甲 +32
    [24] = 7443, -- 附魔胸甲 - 初级法力
    [30] = 3974, -- 粗制瞄准镜
    [32] = 3975, -- 普通瞄准镜
    [33] = 3976, -- 精确瞄准镜
    [34] = 7218, -- 武器平衡锤
    [36] = 6296, -- 附魔：火焰
    [37] = 7220, -- 武器链
    [43] = 7216, -- 铁质盾刺
    [44] = 7426, -- 附魔胸甲 - 初级吸收
    [63] = 13538, -- 附魔胸甲 - 次级吸收
    [65] = 7454, -- 附魔披风 - 初级抗性
    [242] = 7748, -- 附魔胸甲 - 次级生命
    [243] = 7766, -- 附魔护腕 - 初级精神
    [246] = 7776, -- 附魔胸甲 - 次级法力
    [248] = 7782, -- 附魔护腕 - 初级力量
    [249] = 7786, -- 附魔武器 - 初级屠兽
    [250] = 7788, -- 附魔武器 - 初级攻击
    [254] = 7857, -- 附魔胸甲 - 生命
    [256] = 7861, -- 附魔披风 - 次级火焰抗性
    [368] = 34004, -- 附魔披风 - 强效敏捷
    [369] = 34001, -- 附魔护腕 - 特效智力
    [463] = 9781, -- 秘银盾刺
    [464] = 9783, -- 秘银马刺
    [663] = 12459, -- 致命瞄准镜
    [664] = 12460, -- 狙击瞄准镜
    [684] = 33995, -- 附魔手套 - 特效力量
    [744] = 13421, -- 附魔披风 - 次级防护
    [783] = 7771, -- 附魔披风 - 初级防护
    [803] = 13898, -- 附魔武器 - 烈焰
    [804] = 13522, -- 附魔披风 - 次级暗影抵抗
    [805] = 13943, -- 附魔武器 - 强效攻击
    [823] = 13536, -- 附魔护腕 - 次级力量
    [843] = 13607, -- 附魔胸甲 - 法力
    [844] = 13612, -- 附魔手套 - 采矿
    [845] = 13617, -- 附魔手套 - 草药学
    [847] = 13626, -- 附魔胸甲 - 初级属性
    [850] = 13640, -- 附魔胸甲 - 强效生命
    [853] = 13653, -- 附魔武器 - 次级屠兽
    [854] = 13655, -- 附魔武器 - 次级元素杀手
    [857] = 13663, -- 附魔胸甲 - 强效法力
    [863] = 13689, -- 附魔盾牌 - 次级格挡
    [865] = 13698, -- 附魔手套 - 剥皮
    [866] = 13700, -- 附魔胸甲 - 次级状态
    [884] = 13746, -- 附魔披风 - 强效防御
    [903] = 13794, -- 附魔披风 - 抗性
    [905] = 13822, -- 附魔护腕 - 智力
    [906] = 13841, -- 附魔手套 - 高级采矿
    [908] = 13858, -- 附魔胸甲 - 超强生命
    [909] = 13868, -- 附魔手套 - 高级草药学
    [911] = 13890, -- 附魔靴子 - 初级速度
    [912] = 13915, -- 附魔武器 - 屠魔
    [913] = 13917, -- 附魔胸甲 - 超强法力
    [923] = 13931, -- 附魔护腕 - 偏斜
    [924] = 7428, -- 附魔护腕 - 初级偏斜
    [925] = 13646, -- 附魔护腕 - 次级偏斜
    [928] = 13941, -- 附魔胸甲 - 状态
    [930] = 13947, -- 附魔手套 - 骑乘
    [931] = 13948, -- 附魔手套 - 初级加速
    [1071] = 34009, -- 附魔盾牌 - 特效耐力
    [1075] = 44528, -- 附魔靴子 - 强效坚韧
    [1099] = 60663, -- 附魔披风 - 特效敏捷
    [1103] = 44633, -- 附魔武器 - 优异敏捷
    [1128] = 60653, -- 附魔盾牌 - 强效智力
    [1144] = 33990, -- 附魔胸甲 - 特效精神
    [1257] = 34005, -- 附魔披风 - 强效奥术抗性
    [1262] = 44596, -- 附魔披风 - 超强奥术抗性
    [1354] = 44556, -- 附魔披风 - 超强火焰抗性
    [1400] = 44494, -- 附魔披风 - 超强自然抗性
    [1441] = 34006, -- 附魔披风 - 强效暗影抗性
    [1446] = 44590, -- 附魔披风 - 超强暗影抗性
    [1483] = 15340, -- 次级奥术融合
    [1503] = 15389, -- 次级奥术融合
    [1504] = 15391, -- 次级奥术融合
    [1505] = 15394, -- 次级奥术融合
    [1506] = 15397, -- 次级奥术融合
    [1507] = 15400, -- 次级奥术融合
    [1508] = 15402, -- 次级奥术融合
    [1509] = 15404, -- 次级奥术融合
    [1510] = 15406, -- 次级奥术融合
    [1523] = 15427, -- 强效奥术融合
    [1524] = 15429, -- 强效奥术融合
    [1525] = 15439, -- 强效奥术融合
    [1526] = 15441, -- 强效奥术融合
    [1527] = 15444, -- 强效奥术融合
    [1528] = 15446, -- 强效奥术融合
    [1529] = 15449, -- 强效奥术融合
    [1530] = 15458, -- 强效奥术融合
    [1532] = 15463, -- 传说奥术融合
    [1543] = 15490, -- 传说奥术融合
    [1594] = 33996, -- 附魔手套 - 突袭
    [1597] = 60763, -- 附魔靴子 - 强效突袭
    [1600] = 60616, -- 附魔护腕 - 打击
    [1603] = 60668, -- 附魔手套 - 碾压
    [1606] = 60621, -- 附魔武器 - 强效潜能
    [1704] = 16623, -- 瑟银盾刺
    [1843] = 19057, -- 护甲 +40
    [1883] = 20008, -- 附魔护腕 - 强效智力
    [1884] = 20009, -- 附魔护腕 - 超强精神
    [1885] = 20010, -- 附魔护腕 - 超强力量
    [1886] = 20011, -- 附魔护腕 - 超强耐力
    [1889] = 20015, -- 附魔披风 - 超强防御
    [1890] = 20016, -- 附魔盾牌 - 活力
    [1892] = 20026, -- 附魔胸甲 - 特效生命
    [1893] = 20028, -- 附魔胸甲 - 特效法力
    [1894] = 20029, -- 附魔武器 - 冰寒
    [1896] = 20030, -- 附魔双手武器 - 超强冲击
    [1899] = 20033, -- 附魔武器 - 邪恶武器
    [1900] = 20034, -- 附魔武器 - 十字军
    [1903] = 20035, -- 附魔双手武器 - 特效精神
    [1904] = 20036, -- 附魔双手武器 - 特效智力
    [1952] = 44489, -- 附魔盾牌 - 防御
    [1953] = 47766, -- 附魔胸甲 - 强效防御
    [2322] = 33999, -- 附魔手套 - 特效治疗
    [2326] = 44635, -- 附魔护腕 - 强效法术强度
    [2332] = 60767, -- 附魔护腕 - 超强法术能量
    [2381] = 44509, -- 附魔胸甲 - 强效法力回复
    [2443] = 21931, -- 附魔武器 - 寒冬之力
    [2463] = 13657, -- 附魔披风 - 火焰抗性
    [2483] = 22593, -- 火焰黎明衬肩
    [2484] = 22594, -- 冰霜黎明衬肩
    [2485] = 22598, -- 奥术黎明衬肩
    [2486] = 22597, -- 自然黎明衬肩
    [2487] = 22596, -- 暗影黎明衬肩
    [2488] = 22599, -- 多彩黎明衬肩
    [2503] = 22725, -- 防御等级 +5
    [2504] = 22749, -- 附魔武器 - 法术能量
    [2505] = 22750, -- 附魔武器 - 治疗能量
    [2543] = 22840, -- 急速秘药
    [2544] = 22844, -- 专注秘药
    [2545] = 22846, -- 防护秘药
    [2563] = 23799, -- 附魔武器 - 力量
    [2565] = 23801, -- 附魔护腕 - 法力回复
    [2568] = 23804, -- 附魔武器 - 强效智力
    [2583] = 24149, -- 力量的证明
    [2584] = 24160, -- 调和的徽记
    [2587] = 24163, -- 巫毒的警觉
    [2588] = 24164, -- 魔法的视域
    [2589] = 24165, -- 不祥的妖术
    [2590] = 24167, -- 预言的光环
    [2591] = 24168, -- 灵魂的安抚
    [2603] = 13620, -- 附魔手套 - 钓鱼
    [2604] = 24420, -- 赞达拉宁静徽记
    [2605] = 24421, -- 赞达拉魔精徽记
    [2606] = 24422, -- 赞达拉力量徽记
    [2614] = 25073, -- 附魔手套 - 暗影能量
    [2615] = 25074, -- 附魔手套 - 冰霜能量
    [2616] = 25078, -- 附魔手套 - 火焰能量
    [2617] = 25079, -- 附魔手套 - 治疗能量
    [2622] = 25086, -- 附魔披风 - 躲闪
    [2646] = 27837, -- 附魔双手武器 - 敏捷
    [2647] = 27899, -- 附魔护腕 - 强壮
    [2653] = 27944, -- 附魔盾牌 - 坚韧盾牌
    [2654] = 27945, -- 附魔盾牌 - 智力
    [2655] = 27946, -- 附魔盾牌 - 盾牌格挡
    [2656] = 27948, -- 附魔长靴 - 活力
    [2657] = 27951, -- 附魔长靴 - 灵巧
    [2658] = 27954, -- 附魔长靴 - 稳固
    [2659] = 27957, -- 附魔胸甲 - 优异生命
    [2662] = 27961, -- 附魔披风 - 特效护甲
    [2664] = 27962, -- 附魔披风 - 特效抗性
    [2666] = 27968, -- 附魔武器 - 特效智力
    [2667] = 27971, -- 附魔双手武器 - 野蛮
    [2668] = 27972, -- 附魔武器 - 潜能
    [2669] = 27975, -- 附魔武器 - 特效法术能量
    [2670] = 27977, -- 附魔双手武器 - 特效敏捷
    [2671] = 27981, -- 附魔武器 - 阳炎
    [2672] = 27982, -- 附魔武器 - 魂霜
    [2673] = 27984, -- 附魔武器 - 猫鼬
    [2674] = 28003, -- 附魔武器 - 魔法激荡
    [2675] = 28004, -- 附魔武器 - 作战专家
    [2679] = 27913, -- 附魔护腕 - 优秀法力回复
    [2681] = 28161, -- 野性戒卫
    [2682] = 28163, -- 寒冰戒卫
    [2683] = 28165, -- 暗影戒卫
    [2714] = 29454, -- 魔钢盾刺
    [2715] = 29475, -- 天灾的活力
    [2716] = 29480, -- 天灾的坚韧
    [2717] = 29483, -- 天灾的威严
    [2721] = 29467, -- 天灾的力量
    [2722] = 30250, -- 精金瞄准镜
    [2723] = 30252, -- 氪金瞄准镜
    [2745] = 31369, -- 银色魔线
    [2746] = 31370, -- 金色魔线
    [2747] = 31371, -- 秘法魔线
    [2748] = 31372, -- 符文魔线
    [2792] = 32397, -- 结缔皮护甲片
    [2793] = 32398, -- 守备官的护甲片
    [2794] = 32399, -- 魔导师的护甲片
    [2841] = 44968, -- 厚重结缔皮护甲片
    [2928] = 27924, -- 附魔戒指 - 法术能量
    [2929] = 27920, -- 附魔戒指 - 打击
    [2930] = 27926, -- 附魔戒指 - 治疗能量
    [2931] = 27927, -- 附魔戒指 - 属性
    [2933] = 33992, -- 附魔胸甲 - 特效韧性
    [2934] = 33993, -- 附魔手套 - 冲击
    [2935] = 33994, -- 附魔手套 - 精确打击
    [2937] = 33997, -- 附魔手套 - 特效法术能量
    [2938] = 34003, -- 附魔披风 - 法术穿透
    [2939] = 34007, -- 附魔长靴 - 豹之迅捷
    [2940] = 34008, -- 附魔长靴 - 野猪之速
    [2977] = 35355, -- 护卫铭文
    [2978] = 35402, -- 强力护卫铭文
    [2979] = 35403, -- 信仰铭文
    [2980] = 35404, -- 强力信仰铭文
    [2981] = 35405, -- 戒律铭文
    [2982] = 35406, -- 强力戒律铭文
    [2983] = 35407, -- 复仇铭文
    [2984] = 35415, -- 暗影护甲片
    [2985] = 35416, -- 烈焰护甲片
    [2986] = 35417, -- 强力复仇铭文
    [2987] = 35418, -- 冰霜护甲片
    [2988] = 35419, -- 自然护甲片
    [2989] = 35420, -- 奥术护甲片
    [2990] = 35432, -- 骑士铭文
    [2991] = 35433, -- 强力骑士铭文
    [2992] = 35434, -- 神谕铭文
    [2993] = 35435, -- 强力神谕铭文
    [2994] = 35436, -- 宝珠铭文
    [2995] = 35437, -- 强力宝珠铭文
    [2996] = 35438, -- 利刃铭文
    [2997] = 35439, -- 强力利刃铭文
    [2998] = 35441, -- 耐久铭文
    [2999] = 35443, -- 防御者秘药
    [3001] = 35445, -- 恢复秘药
    [3002] = 35447, -- 强能秘药
    [3003] = 35452, -- 凶暴秘药
    [3004] = 35453, -- 角斗士秘药
    [3005] = 35454, -- 自然防护秘药
    [3006] = 35455, -- 奥术防护秘药
    [3007] = 35456, -- 火焰防护秘药
    [3008] = 35457, -- 冰霜防护秘药
    [3009] = 35458, -- 暗影防护秘药
    [3010] = 35488, -- 眼镜蛇皮腿甲片
    [3011] = 35489, -- 裂蹄腿甲片
    [3012] = 35490, -- 虚空毒蛇腿甲片
    [3013] = 35495, -- 虚空裂蹄腿甲片
    [3095] = 37889, -- 多彩防护秘药
    [3096] = 37891, -- 流放者秘药
    [3150] = 33991, -- 附魔胸甲 - 优秀法力回复
    [3223] = 42687, -- 精金武器链
    [3225] = 42974, -- 附魔武器 - 斩杀
    [3230] = 44483, -- 附魔披风 - 超强冰霜抗性
    [3232] = 47901, -- 附魔靴子 - 海象人的活力
    [3233] = 27958, -- 附魔胸甲 - 优异法力
    [3234] = 44488, -- 附魔手套 - 精确
    [3236] = 44492, -- 附魔胸甲 - 极效生命
    [3238] = 44506, -- 附魔手套 - 采集
    [3239] = 44524, -- 附魔武器 - 破冰
    [3241] = 44576, -- 附魔武器 - 生命护卫
    [3243] = 44582, -- 附魔披风 - 法术穿刺
    [3244] = 44584, -- 附魔靴子 - 强效活力
    [3245] = 44588, -- 附魔胸甲 - 优异韧性
    [3246] = 44592, -- 附魔手套 - 优异法术强度
    [3247] = 44595, -- 附魔双手武器 - 天灾斩除
    [3249] = 44612, -- 附魔手套 - 强效冲击
    [3251] = 44621, -- 附魔武器 - 巨人杀手
    [3252] = 44623, -- 附魔胸甲 - 超级属性
    [3253] = 44625, -- 附魔手套 - 士兵
    [3256] = 44631, -- 附魔披风 - 暗影护甲
    [3260] = 44769, -- 手套强固
    [3269] = 45697, -- 真银渔线
    [3273] = 46578, -- 附魔武器 - 死亡霜冻
    [3290] = 52639, -- 弹簧披风扩张器
    [3294] = 47672, -- 附魔披风 - 极效护甲
    [3296] = 47899, -- 附魔披风 - 智慧
    [3297] = 47900, -- 附魔胸甲 - 超级生命
    [3319] = 50465, -- 插槽单手武器
    [3325] = 50901, -- 冰虫腿甲片
    [3326] = 50902, -- 蛛魔腿甲片
    [3329] = 50906, -- 北地护甲片
    [3330] = 50909, -- 厚北地护甲片
    [3331] = 50911, -- 龙鳞腿甲片
    [3332] = 50913, -- 巨龙鳞腿甲片
    [3365] = 53323, -- 裂刃符文
    [3366] = 53331, -- 巫妖斩除符文
    [3367] = 53342, -- 法术碎裂符文
    [3368] = 53344, -- 堕落十字军符文
    [3369] = 53341, -- 灰烬冰河符文
    [3370] = 53343, -- 冰锋符文
    [3594] = 54446, -- 破刃符文
    [3595] = 54447, -- 法术阻断符文
    [3599] = 54736, -- 单兵电磁脉冲发生器
    [3601] = 54793, -- 弹带
    [3603] = 54998, -- 手部火箭发射器
    [3604] = 54999, -- 超级加速器
    [3605] = 55002, -- 高弹力衬垫
    [3606] = 55016, -- 硝化甘油推进器
    [3607] = 55076, -- 太阳瞄准镜
    [3608] = 55135, -- 觅心瞄准镜
    [3718] = 55630, -- 闪光魔线
    [3719] = 55631, -- 辉煌魔线
    [3720] = 55632, -- 碧蓝魔线
    [3721] = 55634, -- 天蓝魔线
    [3722] = 55642, -- 亮纹刺绣
    [3728] = 55769, -- 黑光刺绣
    [3730] = 55777, -- 剑刃刺绣
    [3731] = 55836, -- 泰坦神铁武器链
    [3748] = 56353, -- 泰坦神铁盾刺
    [3754] = 24162, -- 猎鹰的召唤
    [3755] = 24161, -- 死亡之拥
    [3756] = 57683, -- 毛皮衬垫 - 攻击强度
    [3757] = 57690, -- 毛皮衬垫 - 耐力
    [3758] = 57691, -- 毛皮衬垫 - 法术强度
    [3759] = 57692, -- 毛皮衬垫 - 火焰抗性
    [3760] = 57694, -- 毛皮衬垫 - 冰霜抗性
    [3761] = 57696, -- 毛皮衬垫 - 暗影抗性
    [3762] = 57699, -- 毛皮衬垫 - 自然抗性
    [3763] = 57701, -- 毛皮衬垫 - 奥术抗性
    [3775] = 58126, -- 铁律铭文
    [3776] = 58128, -- 霜刃铭文
    [3777] = 58129, -- 王者铭文
    [3788] = 59619, -- 附魔武器 - 精确
    [3789] = 59621, -- 附魔武器 - 狂暴
    [3790] = 59625, -- 附魔武器 - 黑魔法
    [3791] = 59636, -- 附魔戒指 - 耐力
    [3793] = 59771, -- 凯旋铭文
    [3794] = 59773, -- 统御铭文
    [3795] = 59777, -- 凯旋秘药
    [3796] = 59778, -- 统御秘药
    [3797] = 59784, -- 统御秘药
    [3806] = 59927, -- 风暴铭文
    [3807] = 59928, -- 峭壁铭文
    [3808] = 59934, -- 强效利斧铭文
    [3809] = 59936, -- 强效峭壁铭文
    [3810] = 59937, -- 强效风暴铭文
    [3811] = 59941, -- 强效巅峰铭文
    [3812] = 59944, -- 结霜之魂秘药
    [3813] = 59945, -- 剧毒防护秘药
    [3814] = 59946, -- 流离之影秘药
    [3815] = 59947, -- 蚀月秘药
    [3816] = 59948, -- 烈焰之魂秘药
    [3817] = 59954, -- 折磨秘药
    [3818] = 59955, -- 坚定守护者秘药
    [3819] = 59960, -- 祝福治愈秘药
    [3820] = 59970, -- 燃烧之谜秘药
    [3822] = 60581, -- 霜皮腿甲片
    [3823] = 60582, -- 冰鳞腿甲片
    [3824] = 60606, -- 附魔靴子 - 突袭
    [3825] = 60609, -- 附魔披风 - 速度
    [3826] = 60623, -- 附魔靴子 - 履冰
    [3827] = 60691, -- 附魔双手武器 - 杀戮
    [3828] = 44630, -- 附魔双手武器 - 强效野蛮
    [3829] = 44513, -- 附魔手套 - 强效突袭
    [3830] = 44629, -- 附魔武器 - 优异法术能量
    [3831] = 47898, -- 附魔披风 - 强效速度
    [3832] = 60692, -- 附魔胸甲 - 强力属性
    [3833] = 60707, -- 附魔武器 - 超强潜能
    [3834] = 60714, -- 附魔武器 - 极效法术能量
    [3835] = 61117, -- 大师的利斧铭文
    [3836] = 61118, -- 大师的峭壁铭文
    [3837] = 61119, -- 大师的巅峰铭文
    [3838] = 61120, -- 大师的风暴铭文
    [3839] = 44645, -- 附魔戒指 - 突袭
    [3840] = 44636, -- 附魔戒指 - 强效法术能量
    [3842] = 61271, -- 凶残角斗士秘药
    [3843] = 61468, -- 钻石折射瞄准镜
    [3844] = 44510, -- 附魔武器 - 优异精神
    [3845] = 44575, -- 附魔护腕 - 强效突袭
    [3846] = 34010, -- 附魔武器 - 特效治疗
    [3847] = 62158, -- 石肤石像鬼符文
    [3849] = 62201, -- 泰坦神铁护板
    [3850] = 62256, -- 附魔护腕 - 特效耐力
    [3851] = 62257, -- 附魔武器 - 泰坦护卫
    [3852] = 62384, -- 强效角斗士铭文
    [3853] = 62447, -- 土灵腿甲片
    [3854] = 62948, -- 附魔法杖 - 强效法术能量
    [3855] = 62959, -- 附魔法杖 - 法术能量
    [3858] = 63746, -- 附魔靴子 - 次级精确
    [3859] = 63765, -- 弹力蛛丝
    [3860] = 63770, -- 装甲护网
    [3869] = 64441, -- 附魔武器 - 利刃防护
    [3870] = 64579, -- 附魔武器 - 吸血
    [3872] = 56039, -- 神圣魔线
    [3873] = 56034, -- 大师的魔线
    [3875] = 59929, -- 利斧铭文
    [3876] = 59932, -- 巅峰铭文
    [3878] = 67839, -- 思维放大圆盘
    [3883] = 70164, -- 蛛魔甲壳符文

    -- [241] = 7745, -- 附魔双手武器 - 初级冲击
    [241] = 13503, -- 附魔武器 - 次级攻击
    [910] = 25083, -- 附魔披风 - 潜行
    -- [910] = 359640, -- 附魔披风 - 潜行
    [926] = 13933, -- 附魔盾牌 - 冰霜抗性
    -- [926] = 359895, -- 附魔盾牌 - 冰霜抗性
    -- [943] = 13529, -- 附魔双手武器 - 次级冲击
    [943] = 13693, -- 附魔武器 - 攻击
    -- [963] = 13937, -- 附魔双手武器 - 强效冲击
    [963] = 27967, -- 附魔武器 - 特效打击
    [1119] = 44555, -- 附魔护腕 - 优异智力
    -- [1119] = 47715, -- 附魔模板
    [1593] = 34002, -- 附魔护腕 - 突袭
    -- [1593] = 359639, -- 附魔护腕 - 突袭
    -- [1897] = 13695, -- 附魔双手武器 - 冲击
    [1897] = 20031, -- 附魔武器 - 超强打击
    [1898] = 20032, -- 附魔武器 - 生命吸取
    -- [1898] = 27964, -- 附魔武器 - 特效精神
    [2523] = 22779, -- 比兹尼克247x128精确瞄准镜
    -- [2523] = 30255, -- 稳定恒金瞄准镜
    [2567] = 23803, -- 附魔武器 - 强效精神
    -- [2567] = 359642, -- 附魔武器 - 强效精神
    [2613] = 25072, -- 附魔手套 - 威胁
    -- [2613] = 359858, -- 附魔手套 - 威胁
    [2619] = 25081, -- 附魔披风 - 强效火焰抗性
    -- [2619] = 359950, -- 附魔披风 - 强效火焰抗性
    [2620] = 25082, -- 附魔披风 - 强效自然抗性
    -- [2620] = 359949, -- 附魔披风 - 强效自然抗性
    [2621] = 25084, -- 附魔披风 - 狡诈
    -- [2621] = 359847, -- 附魔披风 - 狡诈
    -- [2650] = 23802, -- 附魔护腕 - 治疗能力
    -- [2650] = 27911, -- 附魔护腕 - 超强治疗
    [2650] = 27917, -- 附魔护腕 - 法术能量
    -- [2724] = 30258, -- 稳定恒金瞄准镜
    [2724] = 30260, -- 稳定恒金瞄准镜
    [3229] = 44383, -- 附魔盾牌 - 韧性
    -- [3229] = 359685, -- 附魔盾牌 - 抗性
    -- [3289] = 48555, -- 碎天者之鞭
    -- [3289] = 48557, -- 马鞭
    -- [3289] = 47103, -- 马鞭
    -- [3315] = 48401, -- 棍子上的胡萝卜
    -- [3315] = 48556, -- 棍子上的胡萝卜
    -- [3327] = 50903, -- 冰虫腿甲强化片
    [3327] = 60583, -- 冰虫腿甲强化片
    -- [3328] = 50904, -- 蛛魔腿甲强化片
    [3328] = 60584, -- 蛛魔腿甲强化片
}

local EnchantMultiSpellDB = {
    [41] = {
        [5] = 7420, -- 附魔胸甲 - 初级生命
        [9] = 7418 -- 附魔护腕 - 初级生命
    },
    [66] = {
        [8] = 7863, -- 附魔靴子 - 初级耐力
        [9] = 7457, -- 附魔护腕 - 初级耐力
        [17] = 13378 -- 附魔盾牌 - 初级耐力
    },
    [247] = {
        [8] = 7867, -- 附魔靴子 - 初级敏捷
        [9] = 7779, -- 附魔护腕 - 初级敏捷
        [15] = 13419 -- 附魔披风 - 初级敏捷
    },
    [255] = {
        [9] = 7859, -- 附魔护腕 - 次级精神
        [16] = 13380, -- 附魔双手武器 - 次级精神
        [17] = 13485, -- 附魔盾牌 - 次级精神
        [8] = 13687 -- 附魔靴子 - 次级精神
    },
    [723] = {
        [16] = 7793, -- 附魔双手武器 - 次级智力
        [9] = 13622 -- 附魔护腕 - 次级智力
    },
    [724] = {
        [17] = 13631, -- 附魔盾牌 - 次级耐力
        [9] = 13501, -- 附魔护腕 - 次级耐力
        [8] = 13644 -- 附魔靴子 - 次级耐力
    },
    [846] = {
        [16] = 24302, -- 恒金渔线
        [10] = 71692 -- 附魔手套 - 垂钓
    },
    [848] = {
        [15] = 13635, -- 附魔披风 - 防御
        [17] = 13464 -- 附魔盾牌 - 次级防护
    },
    [849] = {
        [8] = 13637, -- 附魔靴子 - 次级敏捷
        [15] = 13882 -- 附魔披风 - 次级敏捷
    },
    [851] = {
        [9] = 13642, -- 附魔护腕 - 精神
        [17] = 13659, -- 附魔盾牌 - 精神
        [8] = 20024 -- 附魔靴子 - 精神
    },
    [852] = {
        [9] = 13648, -- 附魔护腕 - 耐力
        [17] = 13817, -- 附魔盾牌 - 耐力
        [8] = 13836 -- 附魔靴子 - 耐力
    },
    [856] = {
        [10] = 13887, -- 附魔手套 - 力量
        [9] = 13661 -- 附魔护腕 - 力量
    },
    [904] = {
        [8] = 13935, -- 附魔靴子 - 敏捷
        [10] = 13815 -- 附魔手套 - 敏捷
    },
    [907] = {
        [17] = 13905, -- 附魔盾牌 - 强效精神
        [9] = 13846 -- 附魔护腕 - 强效精神
    },
    [927] = {
        [9] = 13939, -- 附魔护腕 - 强效力量
        [10] = 20013 -- 附魔手套 - 强效力量
    },
    [929] = {
        [9] = 13945, -- 附魔护腕 - 强效耐力
        [17] = 20017, -- 附魔盾牌 - 强效耐力
        [8] = 20020 -- 附魔靴子 - 强效耐力
    },
    [983] = {
        [15] = 44500, -- 附魔披风 - 超强敏捷
        [8] = 44589 -- 附魔靴子 - 超强敏捷
    },
    [1147] = {
        [9] = 44593, -- 附魔护腕 - 特效精神
        [8] = 44508 -- 附魔靴子 - 强效精神
    },
    [1887] = {
        [10] = 20012, -- 附魔手套 - 强效敏捷
        [8] = 20023 -- 附魔靴子 - 强效敏捷
    },
    [1888] = {
        [15] = 20014, -- 附魔披风 - 强效抗性
        [17] = 27947 -- 附魔盾牌 - 抗性
    },
    [1891] = {
        [5] = 20025, -- 附魔胸甲 - 强效属性
        [9] = 27905 -- 附魔护腕 - 属性
    },
    [1951] = {
        [5] = 46594, -- 附魔胸甲 - 防御
        [15] = 44591 -- 附魔披风 - 泰坦之纹
    },
    [2564] = {
        [16] = 23800, -- 附魔武器 - 敏捷
        [17] = 23800, -- 附魔武器 - 敏捷
        [10] = 25080, -- 附魔手套 - 超强敏捷
        -- [10] = 359641 -- 附魔手套 - 超强敏捷
    },
    [2648] = {
        [9] = 27906, -- 附魔护腕 - 特效防御
        [15] = 47051 -- 附魔披风 - 钢纹
    },
    [2649] = {
        [9] = 27914, -- 附魔护腕 - 坚韧
        [8] = 27950 -- 附魔长靴 - 坚韧
    },
    [2661] = {
        [5] = 27960, -- 附魔胸甲 - 优异属性
        [9] = 44616 -- 附魔护腕 - 强效属性
    },
    [3222] = {
        [16] = 42620, -- 附魔武器 - 强效敏捷
        [17] = 42620, -- 附魔武器 - 强效敏捷
        [10] = 44529 -- 附魔手套 - 特效敏捷
    },
    [3231] = {
        [10] = 44484, -- 附魔手套 - 精准
        [9] = 44598 -- 附魔护腕 - 精准
    }
}

function lib:GetEnchantInfo(link, slotID)
    local enchantID = tonumber(string.match(link, "item:%d+:(%d+):"))
    if not enchantID then
        return nil, nil, nil
    end
    local enchantItemID = EnchantItemDB[enchantID]
    local enchantSpellID = EnchantMultiSpellDB[enchantID] and EnchantMultiSpellDB[enchantID][slotID] or EnchantSpellDB[enchantID]
    return enchantItemID, enchantSpellID, enchantID
end

if not (C_Engraving and C_Engraving.IsEngravingEnabled()) then return end

local EnchantRuneDB
local locale = GetLocale()
-- GENERATE BY script.py
if (locale == "enUS" or locale == "enGB") then
    EnchantRuneDB = {["Deadly Brew"] = 399969, ["Between the Eyes"] = 400033, ["Just a Flesh Wound"] = 400039, ["Mutilate"] = 399962, ["Quick Draw"] = 398197, ["Blade Dance"] = 400038, ["Shadowstrike"] = 400031, ["Arcane Blast"] = 401729, ["Burnout"] = 415460, ["Ice Lance"] = 401732, ["Rewind Time"] = 401734, ["Fingers of Frost"] = 401741, ["Regeneration"] = 401743, ["Living Flame"] = 401744, ["Prayer of Mending"] = 402832, ["Shadow Word: Death"] = 402833, ["Homunculi"] = 402836, ["Shared Pain"] = 402838, ["Circle of Healing"] = 402842, ["Penance"] = 402844, ["Envenom"] = 399968, ["Victory Rush"] = 403434, ["Flagellation"] = 403344, ["Endless Rage"] = 403349, ["Blood Frenzy"] = 403352, ["Devastate"] = 403355, ["Furious Thunder"] = 403356, ["Haunt"] = 403858, ["Chaos Bolt"] = 403860, ["Soul Siphon"] = 403863, ["Master Channeler"] = 403868, ["Shadow Bolt Volley"] = 403871, ["Lake of Fire"] = 403872, ["Metamorphosis"] = 403873, ["Beacon of Light"] = 409906, ["Hand of Reckoning"] = 409911, ["Crusader Strike"] = 409914, ["Divine Storm"] = 409924, ["Seal of Martyrdom"] = 409925, ["Avenger's Shield"] = 409933, ["Divine Sacrifice"] = 409935, ["Inspiration Exemplar"] = 409936, ["Wild Strikes"] = 409805, ["Wild Growth"] = 409810, ["Savage Roar"] = 409819, ["Lifebloom"] = 409824, ["Nature's Fury"] = 409826, ["Mangle"] = 409828, ["Fury of Stormrage"] = 409832, ["Dual Wield Specialization"] = 409940, ["Water Shield"] = 409941, ["Shield Mastery"] = 409943, ["Ancestral Guidance"] = 409944, ["Overload"] = 409945, ["Earth Shield"] = 409947, ["Lava Burst"] = 409952, ["Lava Lash"] = 409953, ["Way of Earth"] = 409955, ["Master Marksman"] = 409958, ["Heart of the Lion"] = 409960, ["Beast Mastery"] = 409962, ["Kill Command"] = 409974, ["Chimera Shot"] = 409976, ["Explosive Shot"] = 409978, ["Lone Wolf"] = 409979, ["Earthliving Weapon"] = 415290, ["Enlightenment"] = 415729, ["Living Bomb"] = 401731, ["Mass Regeneration"] = 415467, ["Serendipity"] = 415737, ["Mind Sear"] = 415738, ["Strength of Soul"] = 415740, ["Focused Rage"] = 415745, ["Single-Minded Fury"] = 415599, ["Everlasting Affliction"] = 415604, ["Demonic Tactics"] = 415605, ["Incinerate"] = 415750, ["Exorcist"] = 415756, ["Skull Bash"] = 415759, ["Survival of the Fittest"] = 415709, ["Lacerate"] = 415760, ["Living Seed"] = 415761, ["Sunfire"] = 414692, ["Healing Rain"] = 415714, ["Sniper Training"] = 415818, ["Starsurge"] = 424715, ["Saber Slash"] = 424979, ["Shiv"] = 424980, ["Main Gauche"] = 424982, ["Slaughter from the Shadows"] = 424983, ["Icy Veins"] = 425169, ["Arcane Surge"] = 425168, ["Power Word: Barrier"] = 425212, ["Twisted Faith"] = 425210, ["Void Plague"] = 425211, ["Shamanistic Rage"] = 425341, ["Molten Blast"] = 425340, ["Quick Strike"] = 425428, ["Raging Blow"] = 425429, ["Warbringer"] = 425430, ["Consumed by Rage"] = 425440, ["Frenzied Assault"] = 425442, ["Demonic Pact"] = 425473, ["Demonic Grace"] = 425474, ["Horn of Lordaeron"] = 425614, ["Aegis"] = 425615, ["Rebuke"] = 425616, ["Carve"] = 425754, ["Cobra Strikes"] = 425755, ["Serpent Spread"] = 425756, ["Flanking Strike"] = 425757, }
elseif locale == "zhCN" then
    EnchantRuneDB = {["致命阴谋"] = 399969, ["正中眉心"] = 400033, ["只是皮肉伤"] = 400039, ["毁伤"] = 399962, ["速射"] = 398197, ["刃舞"] = 400038, ["暗影打击"] = 400031, ["奥术冲击"] = 401729, ["燃尽"] = 415460, ["冰枪术"] = 401732, ["时光倒转"] = 401734, ["寒冰指"] = 401741, ["再生"] = 401743, ["活体烈焰"] = 401744, ["愈合祷言"] = 402832, ["暗言术：灭"] = 402833, ["裂魂魔"] = 402836, ["分担痛苦"] = 402838, ["治疗之环"] = 402842, ["苦修"] = 402844, ["毒伤"] = 399968, ["乘胜追击"] = 403434, ["狂热鞭笞"] = 403344, ["无尽怒气"] = 403349, ["血之狂暴"] = 403352, ["毁灭打击"] = 403355, ["狂怒雷霆"] = 403356, ["鬼影缠身"] = 403858, ["混乱之箭"] = 403860, ["灵魂虹吸"] = 403863, ["引导大师"] = 403868, ["暗影箭雨"] = 403871, ["火焰之湖"] = 403872, ["恶魔变形"] = 403873, ["圣光道标"] = 409906, ["清算之手"] = 409911, ["十字军打击"] = 409914, ["神圣风暴"] = 409924, ["殉道圣印"] = 409925, ["复仇者之盾"] = 409933, ["神圣牺牲"] = 409935, ["激励典范"] = 409936, ["狂野打击"] = 409805, ["野性成长"] = 409810, ["野蛮咆哮"] = 409819, ["生命绽放"] = 409824, ["自然之怒"] = 409826, ["割碎"] = 409828, ["怒风之怒"] = 409832, ["双武器专精"] = 409940, ["水之护盾"] = 409941, ["盾牌精通"] = 409943, ["先祖指引"] = 409944, ["过载"] = 409945, ["大地之盾"] = 409947, ["熔岩爆裂"] = 409952, ["熔岩猛击"] = 409953, ["土之道"] = 409955, ["神射手"] = 409958, ["雄狮之心"] = 409960, ["野兽控制"] = 409962, ["杀戮命令"] = 409974, ["奇美拉射击"] = 409976, ["爆炸射击"] = 409978, ["独来独往"] = 409979, ["大地生命武器"] = 415290, ["启迪"] = 415729, ["活动炸弹"] = 401731, ["群体再生"] = 415467, ["妙手回春"] = 415737, ["精神灼烧"] = 415738, ["灵魂之力"] = 415740, ["怒火聚焦"] = 415745, ["鲁莽怒火"] = 415599, ["持久痛苦"] = 415604, ["恶魔战术"] = 415605, ["烧尽"] = 415750, ["驱魔人"] = 415756, ["迎头痛击"] = 415759, ["优胜劣汰"] = 415709, ["割伤"] = 415760, ["生命之种"] = 415761, ["阳炎术"] = 414692, ["治疗之雨"] = 415714, ["狙击训练"] = 415818, ["星涌术"] = 424715, ["军刀猛刺"] = 424979, ["毒刃"] = 424980, ["左右开弓"] = 424982, ["暗影杀手"] = 424983, ["冰冷血脉"] = 425169, ["奥术涌动"] = 425168, ["真言术：障"] = 425212, ["扭曲信仰"] = 425210, ["虚空疫病"] = 425211, ["萨满之怒"] = 425341, ["熔火爆裂"] = 425340, ["迅捷打击"] = 425428, ["怒击"] = 425429, ["战神"] = 425430, ["噬心狂怒"] = 425440, ["狂乱攻击"] = 425442, ["恶魔契约"] = 425473, ["恶魔优雅"] = 425474, ["洛丹伦号角"] = 425614, ["神盾"] = 425615, ["责难"] = 425616, ["削凿"] = 425754, ["眼镜蛇打击"] = 425755, ["毒蛇扩散"] = 425756, ["侧翼打击"] = 425757, }
elseif locale == "zhTW" then
    EnchantRuneDB = {["致命毒釀"] = 399969, ["正中眉心"] = 400033, ["不過是點皮肉傷"] = 400039, ["截肢"] = 399962, ["拔槍快手"] = 398197, ["劍刃之舞"] = 400038, ["暗影打擊"] = 400031, ["秘法衝擊"] = 401729, ["燃盡"] = 415460, ["冰霜長矛"] = 401732, ["時光倒流"] = 401734, ["冰霜之指"] = 401741, ["再生"] = 401743, ["活化烈焰"] = 401744, ["癒合禱言"] = 402832, ["暗言術：死"] = 402833, ["魔胎"] = 402836, ["共享苦痛"] = 402838, ["治療之環"] = 402842, ["懺悟"] = 402844, ["毒化"] = 399968, ["勝利衝擊"] = 403434, ["鞭策"] = 403344, ["無盡狂怒"] = 403349, ["血之狂暴"] = 403352, ["挫敗"] = 403355, ["盛怒轟雷"] = 403356, ["蝕魂術"] = 403858, ["混沌箭"] = 403860, ["靈魂虹吸"] = 403863, ["引導大師"] = 403868, ["暗影箭雨"] = 403871, ["火焰之湖"] = 403872, ["惡魔化身"] = 403873, ["聖光信標"] = 409906, ["清算聖禦"] = 409911, ["十字軍聖擊"] = 409914, ["神性風暴"] = 409924, ["殉難聖印"] = 409925, ["復仇之盾"] = 409933, ["神性犧牲"] = 409935, ["鼓舞楷模"] = 409936, ["狂野打擊"] = 409805, ["野性痊癒"] = 409810, ["兇蠻咆哮"] = 409819, ["生命之花"] = 409824, ["自然烈怒"] = 409826, ["割碎"] = 409828, ["怒風之怒"] = 409832, ["雙武器專精"] = 409940, ["水之盾"] = 409941, ["精通盾牌"] = 409943, ["先祖導引"] = 409944, ["超載"] = 409945, ["大地之盾"] = 409947, ["熔岩爆發"] = 409952, ["熔岩暴擊"] = 409953, ["大地之道"] = 409955, ["狙擊大師"] = 409958, ["猛獅之心"] = 409960, ["野獸控制"] = 409962, ["擊殺命令"] = 409974, ["奇美拉射擊"] = 409976, ["爆裂射擊"] = 409978, ["孤狼"] = 409979, ["大地生命武器"] = 415290, ["啟蒙"] = 415729, ["活體爆彈"] = 401731, ["群體恢復"] = 415467, ["機緣回復"] = 415737, ["心靈烙印"] = 415738, ["靈魂之力"] = 415740, ["集中怒氣"] = 415745, ["一心狂怒"] = 415599, ["無間痛苦"] = 415604, ["惡魔策略"] = 415605, ["燒盡"] = 415750, ["驅邪術"] = 415756, ["碎顱猛擊"] = 415759, ["適者生存"] = 415709, ["割裂"] = 415760, ["生命種子"] = 415761, ["日炎術"] = 414692, ["治癒之雨"] = 415714, ["狙擊訓練"] = 415818, ["星湧術"] = 424715, ["刀劍斬擊"] = 424979, ["毒襲"] = 424980, ["左右開弓"] = 424982, ["伏影抹殺"] = 424983, ["冰寒脈動"] = 425169, ["秘法奔騰"] = 425168, ["真言術：壁"] = 425212, ["扭曲信念"] = 425210, ["虛無瘟疫"] = 425211, ["薩滿之怒"] = 425341, ["熔岩爆裂"] = 425340, ["快速打擊"] = 425428, ["狂怒之擊"] = 425429, ["戰爭使者"] = 425430, ["怒火攻心"] = 425440, ["狂暴襲擊"] = 425442, ["惡魔契印"] = 425473, ["魔化恩典"] = 425474, ["羅德隆號角"] = 425614, ["神禦"] = 425615, ["責難"] = 425616, ["橫劈"] = 425754, ["眼鏡蛇之擊"] = 425755, ["蛇毒蔓延"] = 425756, ["側翼攻擊"] = 425757, }
end

function lib:IsEquipmentSlotEngravable(slot)
    if not EnchantRuneDB then return false end

    if not lib.RuneCategories then
        lib.RuneCategories = {}
        C_Engraving.RefreshRunesList()
        for _, categories in ipairs(C_Engraving.GetRuneCategories(false, false)) do
            lib.RuneCategories[categories] = true
        end
    end

    return not not lib.RuneCategories[slot]
end

function lib:GetRuneInfo(unit, slot)
    if not EnchantRuneDB then return end

    local tip = lib.ScanTip
    tip:SetOwner(UIParent, "ANCHOR_NONE")
    tip:SetInventoryItem(unit, slot)
    for i = 2, tip:NumLines() do
        local line = _G[lib.ScanTipName.."TextLeft"..i]
        if not line then break end

        local text = line:GetText()
        local spell = text and EnchantRuneDB[text]
        if spell then
            return text, spell
        end
    end
end